<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!-- saved from url=(0083)file://C:\WINDOWS\Archivos%20temporales%20de%20Internet\OLKA1F1\ReadmeEspañolv2.htm -->
<!-- saved from url=(0022)http://internet.e-mail --><!-- saved from url=(0022)http://internet.e-mail --><HTML><HEAD><TITLE>Readme</TITLE>
<META http-equiv=Content-Type content="text/html; charset=windows-1252">
<META content="Microsoft FrontPage 5.0" name=GENERATOR>
</HEAD>
<BODY bgColor=#ffffff>
<BLOCKQUOTE>
  <DIV align=left>
  <P align=center>
  <BR>
  Asegúrese de leer el fichero <a target="_blank" href="../License.html">Malted Distribution License</a>.<BR>
      <BR>
      **********************************************</P>
  <P align=center><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.3.0</STRONG></FONT></BIG></BIG></BIG><BR>
  <strong><font color="#0000FF">(Noviembre, 2008) </font></strong></P>
  <table width="80%" border="1" align="center">
    <tr>
      <td><div align="center"><font color="#0000FF" face="Calisto MT">Malted 3.0 
        - Mejoras incluidas</font></div></td>
    </tr>
    <tr>
      <td>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Creación de un Editor de 
          actividades y cursos totalmente nuevo.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Traducción 
          del Editor a varias lenguas (español, inglés, catalán, gallego, euskara 
          y valenciano)</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Adaptación de Malted y 
          del instalador para mejorar la compatibilidad con Windows 98.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Revisadas todas las 
          unidades de Inglés Secundaria y corregidos varios errores detectados.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Unificados los ficheros de 
      Notas para el Profesor de las unidades de Inglés para Secundaria.<br>
        </p>
          </td>
    </tr>
  </table>
  <P align=center><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.2.6</STRONG></FONT></BIG></BIG></BIG><BR>
  <strong><font color="#0000FF">(Noviembre, 2007) </font></strong></P>
  <table width="80%" border="1" align="center">
    <tr>
      <td><div align="center"><font color="#0000FF" face="Calisto MT">Malted 2.6 
        - Mejoras incluidas</font></div></td>
    </tr>
    <tr>
      <td><p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Nueva instalación con 
      el JRE y el JMF integrados dentro de Malted, lo que permite en Windows su 
      utilización sin instalación desde el propio CD.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Actualizado el lanzador como ejecutable dentro de la carpeta Malted.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Corregidos varios bugs 
          del programa.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Creación de un nuevo 
          instalador disponible para Windows/Linux y para CD/web (que incorpora 
          el JMF en todas sus versiones).</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Ampliada la ayuda del editor.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Actualizaciones y 
          corrección de errores en las unidades existentes.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Añadidos los grupos de 
          unidades Tests, Consolidation Units y Puzzles and Games para E.S.O. 
          Inglés.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Creada una unidad 
          índice para acceder al resto de los materiales.</p>
          <p style="margin-top: 10; margin-bottom: 10; line-height:150%">- Añadida una Guía 
          Didáctica accesible a partir de la unidad Index.<br>
        </p>
          </td>
    </tr>
  </table>
  <P align=center><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.2.5</STRONG></FONT></BIG></BIG></BIG><BR>
  <strong><font color="#0000FF">(Noviembre, 2006) </font></strong></P>
  <table width="80%" border="1" align="center">
    <tr>
      <td><div align="center"><font color="#0000FF" face="Calisto MT">Malted 2.5 
        - Mejoras incluidas desde la versión 2.3 - </font></div></td>
    </tr>
    <tr>
      <td><p><strong>Instalación:</strong><br>
        - Mejorada la instalación en Linux e implementación hasta la versión 2.5 
      con JavaWebStart instalando solo los componentes necesarios<br>
        - Mejorada la instalación en Windows instalando solo los programas 
      necesarios.<br>
        - Actualizada la versión de java incluida en el CD a la versión jre-1_5_0_09-windows-i586-p.exe 
      para Windows y jre-1_5_0_09-linux-i586.bin para Linux que agiliza la 
      transición entre los frames y mejora el comportamiento y estabilidad de 
      MALTED.<br>
        - Actualizada la versión de Java Media Framework a la versión 2.1.1e que 
      mejora la reproducción de mp3, incorporada también el Linux en el 
      Instalador de Malted, no siendo necesaria por tanto su instalación.<br>
        - Actualizado Tutorial a la versión 2.5.</p>
          <p><strong>Navegador Malted</strong></p>
          <p>- Los popouttext y la ventana de corrección del alumno con nueva 
          apariencia y modificable desde project.cfg.<br>
          - projects.cfg incorpora posibilidades de configuración de Malted 
          (proyecto de inicio, configuración de ventanas emergentes, etc).<br>
          - Mejoras en los mensajes del sistema. Posibilidad de seleccionar el 
          idioma a través de project.cfg.</p>
          <p><strong>Editor Malted</strong><br>
          - Posiblildad de incluir imágenes de sustituición en los media.<br>
          - Nuevo Editor RTF en el Editor Malted. Se incluye la posibilidad de 
          editar los textos en la propia edición de frames del Editor Malted.<br>
          - Incluido el acceso a Importar ficheros multimedia desde el Editor 
          Malted.<br>
          - Incluidas Autoacciones para frames y paneles.<br>
          - Incluidos nuevos parámetros documentados en el Tutorial Malted.<br>
          - Nuevos botones.<br>
          - Actualizada la instalación de recursos con nuevas imágenes e 
          ilustraciones.<br>
          - Mejora en la Edición de la plantilla Crucigrama.<br>
          - Incluida nueva unidad templates (plantillas) sustituyendo a la 
          anterior para la creación de actividades.<br>
          - Nueva Unidad llamada Malted_25, que ilustra con ejemplos prácticos 
          el funcionamiento de las distintas plantillas y posibilidades de 
          Malted. Estas plantillas&nbsp;están listas para&nbsp;ser importadas y utilizadas 
          como punto de partida en los proyectos propios <br>
        </p></td>
    </tr>
  </table>
  <p align="center"><font color="#0000FF"><strong><big><big><big>Malted v.2.4</big></big></big> (UCL) <br>
  (2004)</strong></font>
</p>
  <p align="center"><font color="#0000FF"><strong><big><big><big>Malted v.2.3</big></big></big> (UCL) <br>
(2004)</strong></font> </p>
  </DIV>
  <table width="80%" border="1" align="center">
    <tr>
      <td><div align="center"><font color="#0000FF" face="Calisto MT">Malted 2.3 - Mejoras incluidas  - </font></div></td>
    </tr>
    <tr>
      <td><p>- Es posible grabar DVE y RTS mp3. En el Valor de la acci&oacute;n de grabar, escribir el nombre del archivo con la extensi&oacute;n mp3 y el archivo se crear&aacute; autom&aacute;ticamente. (No es necesario crear anteriormente un mp3 vac&iacute;o en la carpeta de audio del proyecto).<br>
        - 
        Nueva entrada en la p&aacute;gina del Navegador de Malted por defecto.<br>
        - La acci&oacute;n Seleccione_curso permite asignar un valor.<br>
        - 
        Problemas resueltos: no se pod&iacute;a seleccionar curso cuando se eleg&iacute;a Cancelar en Seleccione_curso<br>
        - 
        Hay m&aacute;s informaci&oacute;n en el mensaje err&oacute;neo “No hay frames en proyecto”<br>
        - La tecla para el Primer ejercicio en el men&uacute; azul puede ahora saltar al primer ejercicio del curso, y si se presiona vuelve otra vez al curso anterior.<br>
        - Se ha a&ntilde;adido un bot&oacute;n al men&uacute; azul para saltar a la entrada por defecto del Navegador de Malted.<br>
        - Instalaci&oacute;n del espa&ntilde;ol por defecto como idioma de Malted.<br>
        - 
        Nueva acci&oacute;n a&ntilde;adida: Curso_principal (no hace falta valor)<br>
        -
        Los botones en marcos de popout funcionan correctamente ahora.<br>
        - 
        Nuevas im&aacute;genes y textos a&ntilde;adidos para ventanas de licencias y derechos de autor.<br>
        - Las descripciones para Acciones e Interacciones se pueden publicar y traducir en Malted2/languages/properties.zip <br>
        - LMS. El LMS ha sido incluido en la instalaci&oacute;n Malted. Para activarlo es necesario insertar el IP del servidor donde est&aacute; localizado el LMS en el archivo Malted/config/LMS.cfg usando por ejemplo “host=197.90.87.50” <br>
        - 
        Cada proyecto que se incluir&aacute; en el LMS debe tener su propio archivo de proyecto cfg as&iacute; como una l&iacute;nea en el archivo html indicando la ruta del LMS_Learner .jar: </p>
        <p>ARCHIVO= “clases/Malted Applet.jar,clases/parser.jar,clases/jaxp.jar,clases/LMS.jar”</p>
        <p><strong>Malted v.2.0.3 (agosto 21,2002) Malted 2-versi&oacute;n 2.0.3 Nuevas caracter&iacute;sticas y problemas resueltos </strong></p>
        <p>- DVE. Es posible generar un archivo html con una llamada al curso de Malted applet. Este archivo tiene el mismo nombre que el curso pero con extensi&oacute;n html.<br>
          - Problema: Diferentes marcos con la misma terminaci&oacute;n en el nombre se consideraban iguales. Arreglado <br>
          - Problema: La acci&oacute;n de borrar objeto no tomaba en consideraci&oacute;n la respuesta del usuario (si/no). Arreglado <br>
          - Hay un nuevo icono en la parte superior derecha de cursos y marcos para cerrarlos. <br>
          - 
          Interacci&oacute;n de emparejar2. Hay un nuevo par&aacute;metro N&uacute;mero- flecha para configurar el mayor n&uacute;mero posible de flechas que el usuario puede asociar a un medio cuando hay verificaci&oacute;n=on Asociaci&oacute;n. El valor por defecto es flechaN&uacute;mero=1. <br>
          - 
          El usuario puede ahora asociar s&oacute;lo un n&uacute;mero entre dos medios cuando hay verificaci&oacute;n=onAsociaci&oacute;n. En versiones anteriores el usuario pod&iacute;a hacer cualquier cantidad de asociaciones. <br>
          - 
          Interacci&oacute;n de transcribir. Hay un nuevo par&aacute;metro ignoreCAse para configurar comparaciones al verificar. El valor por defecto es ignoreCAse=No <br>
          - 
          Interacci&oacute;n de memoria. La descripci&oacute;n de reintentar la acci&oacute;n no era correcta. Esto ya est&aacute; arreglado. <br>
          - 
          Applet y RTS. Cuando se arrastra un objeto el cursor del rat&oacute;n simula el objeto arrastrado <br>
          - 
          La acci&oacute;n animada interpreta una nueva duraci&oacute;n del par&aacute;metro cuando no hay ning&uacute;n audio asociado. </p>
        <p><strong>Malted v.2.0.2 (junio 10, 2002) Malted 2- versi&oacute;n 2.0.1 Nuevas caracter&iacute;sticas y problemas resueltos </strong></p>
        <p>- Applet y RTS. Las im&aacute;genes del Colgado_001.plantilla han sido reemplazadas por nuevas cedidas por el CNICE.<br>
          - 
        Interacci&oacute;n de memoria. Hay un nuevo par&aacute;metro backCardImage para seleccionar las im&aacute;genes de tarjetas al rev&eacute;s. <br>
        - 
        El valor por defecto es images/maltedbg.jpg que el programa encuentra en malted.jar. <br>
        - La acci&oacute;n de volverlo a intentar no funcionaba correctamente. Volteaba las tarjetas hacia ariba en vez de hacia abajo. El problema ya est&aacute; resuelto. <br>
        - Interacci&oacute;n de llenar espacios. Hab&iacute;a problemas cuando el valor por defecto repet&iacute;a cifras (por ejemplo “11,000). El problema ya est&aacute; resuelto </p>
        <p><strong>Malted v.2.0 (mayo 16,2002) Malted 2-versi&oacute;n 2.0 Problemas resueltos </strong></p>
        <p>- Applet y RTS. Los videos incluidos desaparec&iacute;an cuando llegaban al final. Esto se deb&iacute;a a un problema que surgi&oacute; en beta 8.5 cuando los videos popOut se hicieron para cerrarse cuando llegaban al final . Este problema ha sido arregado. <br>
        </p>
      </td>
    </tr>
  </table>
  <P align=center><BR><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.2 
  (beta 8.5)</STRONG></FONT></BIG></BIG></BIG> <BR></P>
  <TABLE width=80% border=1 align="center">
    <TBODY>
      <TR>
        <TD vAlign=top width=679 height=83><B><FONT color=#000000><STRONG>Applet and RTS</STRONG>.</FONT></B>
            <UL>
              <LI><FONT color=#000000>The embedded videos were being disposed when they arrived to the end. This was a bug introduced in beta 8.5 when popOut videos were made to close when arriving at the end.&nbsp; The bug has been fixed.</FONT> </LI>
          </UL></TD>
      </TR>
    </TBODY>
  </TABLE>
  <TABLE width=80% border=1 align="center">
    <TBODY>
    <TR>
      <TD vAlign=top width=679 height=23>
        <DIV align=center><FONT face="Calisto MT" color=#0000ff><BIG>Malted 2 - 
        beta 8.5 Nuevas Características y Errores Corregidos</BIG></FONT></DIV></TD></TR>
    <TR>
      <TD vAlign=top height=134><FONT 
        color=#000000><STRONG>DVE</STRONG>.</FONT> 
        <UL>
          <LI><FONT color=#000000>Cuando se graba un curso, se crea un fichero 
          html con el mismo nombre, (excepto la extensión .html), con la 
          pertinente llamada al applet de html. Si el fichero ya existiese, 
          entonces no se hace nada. Este fichero se crea en el directorio de 
          proyectos. La anchura y los atributos de altura son los especificados 
          en el parámetro frame_size de project.cfg</FONT>.<BR><BR>
          <LI><FONT color=#000000>Todas las exportaciones a los objetos de 
          assetbase se han eliminado del menu en el fichero 
          config/menu.xml.</FONT> </LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=90>
        <P><B>Applet y RTS.</B></P>
        <UL>
          <LI><FONT color=#000000>Los audios y videos embebidos en un 
          "popOutFrame", antes no se detenían cuando se cerraba el 
          "popOutFrame". Ahora se paran y son eliminados de la 
          memoria.<BR></FONT>
          <LI><FONT color=#000000>Cuando se usan diferentes idiomas, en algunos 
          casos aparecía un cuadro de diálogo mostrando el mensaje "nombre de 
          fichero no disponible". Era un error y ahora está 
corregido.<BR></FONT>
          <LI><FONT color=#000000>El icono del menu "connect to assetbase" ya no 
          aparece más.</FONT><BR>
          <LI><FONT color=#000000>Las ventanas de video se cierran 
          automáticamente al final, como en las versiones antiguas.</FONT><FONT 
          color=#000000><BR></FONT>
          <LI><FONT color=#000000>Las ventanas de audio y video ahora no tienen 
          título, el nombre del fichero ya no se muestra más.</FONT> 
  </LI></UL></TD></TR></TBODY></TABLE>
  <P align=center><BR><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.2 
  (beta 8.4)</STRONG></FONT></BIG></BIG></BIG> <BR></P>
  <TABLE width=80% border=1 align="center">
    <TBODY>
    <TR>
      <TD vAlign=top width=679 height=23>
        <DIV align=center>
        <P><FONT face="Calisto MT" color=#0000ff><BIG>Malted 2 - beta 8.4 Nuevas 
        Características y Errores Corregidos</BIG></FONT></P></DIV></TD></TR>
    <TR>
      <TD vAlign=top height=95><FONT 
        color=#000000><STRONG>DVE</STRONG>.</FONT> 
        <UL>
          <LI><FONT color=#000000>La "action" Add Container ahora añade el nuevo 
          "container" encima de los demás. Versiones anteriores añadían al nuevo 
          contenedor por debajo del resto.</FONT> </LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=122>
        <P><FONT color=#000000><B>Applet y RTS.</B></FONT> </P>
        <UL>
          <LI><FONT color=#000000>El acceso remoto a ficheros se ha modificado 
          de manera que solo las peticiones http GET que son respondidas con OK 
          (código 200) se consideran correctas. Esti quiere decir que las 
          <B>redirecciones</B> <B>no se siguen</B>. La razón para hacer esto es 
          que el servidor del CNICE redirecciona peticiones de páginas no 
          existentes a una página web de error (devolviendo el código 302) 
          cuando lo que quiere decir es que el archivo no existe (devolviendo el 
          codigo 404) que provoca que Malted lea la página Web de error oficial 
          del servidor en lugar de saber que el archivo no está presente. El 
          hecho de que algunos ficheros existan o no, es importante en Malted, 
          especialmente para el sistemas de traducciones.</FONT> 
  </LI></UL></TD></TR></TBODY></TABLE>
  <DIV align=center><BIG><BIG><BIG><FONT color=#0000ff><STRONG>Malted v.2 (beta 
  8.3)</STRONG></FONT></BIG></BIG></BIG> <BR><BR></DIV>
  <TABLE width=80% border=1 align="center">
    <TBODY>
    <TR>
      <TD vAlign=top width=679 height=29>
        <DIV align=center><FONT face="Calisto MT" color=#0000ff><BIG>Malted 2 - 
        beta 8.3 Nuevas Características y Errores 
      corregidos</BIG></FONT></DIV></TD></TR>
    <TR>
      <TD vAlign=top height=89>
        <P><FONT color=#000000><B>ACTION goToCourse.</B></FONT></P>
        <UL>
          <LI><FONT color=#000000>La ACTION <B>goToCourse</B> ha sido mejorada. 
          Ahora si el campo VALUE contiene algo como<BR><BR><SMALL><FONT 
          face="Courier New">file:/[X]:/projects/projectName/xml/courseName.cxml"Insert 
          the CD"</FONT></SMALL><BR><BR>entonces el archivo del curso 
          correspondiente se busca en todas las unidades de disco del computador 
          (exceptuando las unidades de floppy) desde la C: a la Z:. Si el curso 
          se encuentra, entoces se ejecuta, pero si no se encuentra, aparece un 
          cuadro de diálogo con el mensaje "Inserte el CD". El cuadro de diálogo 
          tiene los botones OK y CANCEL. Si el usuario pulsa OK, el programa 
          vuelve a buscar en todas las unidades, pero si pulsa CANCEL se cancela 
          toda la operación.</FONT> </LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=148>
        <P><FONT color=#000000><B>Botón "Home" (en el menú 
        runtime).</B></FONT></P>
        <UL>
          <LI><FONT color=#000000>Como en las versiones previas, el botón home 
          del menú navega hasta el primer frame de un curso, pero si ya se está 
          en el primer frame, entoces se navega al curso previo, si es que 
          existe. Esto permite navegar hacia atrás, no solo dentro de un curso, 
          sino también entre cursos.<BR><BR></FONT></LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=84>
        <P><FONT color=#000000><B>Liberación de los Recursos 
        Media.</B></FONT></P>
        <UL>
          <LI><FONT color=#000000>Los sonidos en el Diccionario ahora, se 
          liberan ifual que el resto de los recursos.<BR></FONT></LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=67>
        <P><FONT color=#000000><B>Refresco de Pantalla.</B></FONT></P>
        <UL>
          <LI><FONT color=#000000>Algunas veces, las imágenes desaparecían 
          cuando se cambiaba de card en "RunAllDialog". Este aspecto se ha 
          mejorado.<BR></FONT><FONT color=#000000><BR></FONT>
          <LI><FONT color=#000000>Las funciones de refresco se llaman ahora más 
          a menudo para arreglar ciertos problemas de refresco que ocurrían por 
          ejemplo en la interacción Match2(arrastrando imágenes) o en Memory 
          Game.</FONT> </LI></UL></TD></TR>
    <TR>
      <TD vAlign=top height=69>
        <P><FONT color=#000000><B>Errores.</B> </FONT></P>
        <UL>
          <LI><FONT color=#000000>Los proyectos que no eran subdirectorios del 
          directorio <SMALL><FONT face="Courier New">projects/</FONT></SMALL> no 
          podían leer los ficheros de audio y video. Este problema se ha 
          resuelto.<BR><BR></FONT>
          <LI>Los clicks sobre los objetos TEXT no estaban respondiendo 
          correctamente, y no era posible usarlos para acciones habituales como 
          courseLink. El problema se ha resuelto.<BR><BR>
          <LI><FONT color=#000000>El menú escondido ahora fucniona mejor, ya que 
          antes lanzaba algunas excepciones.<BR><BR></FONT>
          <LI><FONT color=#000000>La action <B>clear</B> ein 
          <B>Transcription</B> y <B>GapFilling</B> funcionaba solo cuando el 
          panel y el container eran especificados en el campo VALUE. Ahora 
          funciona con un valor vacío en dicho campo. 
  </FONT></LI></UL></TD></TR></TBODY></TABLE>
  <DIV align=center>
  <P><FONT color=#0000ff><STRONG><BIG><BIG><BIG>Malted v.2 (beta 
  8.2)</BIG></BIG></BIG></STRONG></FONT> </P>
  <P><BR></P></DIV>
  <TABLE width="80%" border=1 align="center">
    <TBODY>
    <TR>
      <TD width="100%">
        <P align=center><FONT face="Calisto MT" color=#0000ff><BIG>Malted 2 - 
        beta 8.2 Errores corregidos</BIG></FONT> </P></TD></TR>
    <TR>
      <TD width="100%">
        <P><FONT face="Calisto MT" color=#000000><B>Liberacion de los recursos 
        de los media.</B></FONT></P>
        <UL>
          <LI><FONT face="Calisto MT" color=#000000>Se ha hecho un cambio 
          imortante en el orden de liberación de los recursos de los media. El 
          orden usado previamente causaba problemas internos algunas veces, 
          dando el mensaje de error "unrealized player" y agujeros de memoria. 
          El nuevo orden parece funcionar mucho mejor, los recursos son 
          liberados inmediatamente y los los cuelgues de memoria han 
          desaparecido.</FONT> </LI></UL></TD></TR>
    <TR>
      <TD width="100%"><FONT face="Calisto MT" color=#000000><STRONG>Refresco 
        de la pantalla.</STRONG></FONT> 
        <UL>
          <LI><FONT face="Calisto MT" color=#000000>Los huecos de algunos 
          ejercicios de GapFilling desaparecían después de cambiar el lenguaje. 
          Esto se ha solucionado.</FONT> 
          <LI>Algunas imágenes desaparecían. Esto se ha solucionado. 
          <LI><FONT face="Calisto MT" color=#000000>Se ha implementado una 
          llamada extra a una función de refresco para asegurar que todos los 
          cambios en un frame se actualizan en la pantalla.</FONT> 
</LI></UL></TD></TR>
    <TR>
      <TD width="100%">
        <P><FONT face="Calisto MT" color=#000000><B>Medias incrustados en 
        DVE.</B></FONT></P>
        <UL>
          <LI><FONT face="Calisto MT" color=#000000>Los audios y videos 
          incrustados en DVE no mostraban los iconos correspondientes de audio y 
          video. Esto podia deberse a otra serie de problemas que hacían que DVE 
          se cerrara de repente. Este problema se ha resuelto.</FONT> 
  </LI></UL></TD></TR></TBODY></TABLE>
  <P align=left>&nbsp;</P>
  <TABLE width="80%" border=1 align="center">
    <TBODY>
    <TR>
      <TD width="100%">
        <P align=center><FONT face="Calisto MT" color=#0000ff><BIG>Malted 2 - 
        beta 8 Nuevas características y Errores corregidos</BIG></FONT> 
    </P></TD></TR>
    <TR>
      <TD width="100%"><STRONG><FONT face="Calisto MT" color=#000000>Grabación 
        de sonido en Java.</FONT></STRONG> 
        <UL>
          <LI><FONT face="Calisto MT" color=#000000>Se ha desarrollado un nuevo 
          sistema de grabación que no requiere ningún programa de grabación 
          externo.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>El nuevo sistema de 
          grabación incluye un <B>intefaz gráfico</B> parecido al de windows 
          sndrec32, pero con algunas diferencias. Sólo puede ser usado para 
          grabar, pero no para cargar y reproducir ficheros de audio. El 
          interfaz gráfico para la grabación se invoca mediante la nueva ACTION 
          <B>record</B>.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>También hay un método de 
          grabación no gráfico, que se invoca mediante la ACTION 
          <B>autoRecord.</B></FONT> 
          <LI><FONT face="Calisto MT" color=#000000>El resultado de la grabación 
          es automáticamente guardado en un fichero o almacenado en memoria RAM, 
          quedando listo para la reproducción a través de la nueva ACTION 
          <B>ramPlay</B>.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>Con estas nuevas ACTIONS, el 
          nuevo sistema de grabación viene provisto de cuatro posibles modos de 
          grabación:</FONT> </LI></UL>
        <OL>
          <LI><FONT face="Calisto MT" color=#000000>Interfaz <B>gráfico</B>, con 
          la grabación almacenada en un <B>fichero</B>. Para utilizar este modo, 
          el autor debe usar la nueva ACTION <B>record</B>. Esto se hace 
          exactamente de la misma manera a como se hacia con la antigua ACTION 
          <B>winRecord.</B> p.ej.: se pone en el campo VALUE el nombre del 
          fichero WAV en el que se va a guardar la grabación. La reproducción 
          asociada "play" se puede poner con un objeto media en el que se 
          indique dicho nombre de fichero como valor del campo AUDIO.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>Interfaz <B>gráfico</B> con 
          la grabación alamacenada temporalmente, sólo en memoria<B> RAM</B>. 
          Para utilizar este modo, hay que usar de nuevo la ACTION <B>record</B> 
          pero con un valor vacío en el campo VALUE y asignarle un NOMBRE no 
          vacío al objeto media. En este caso, no se crea ningún fichero. Para 
          <B>reproducir</B> la grabación es <B>necesario, </B>poner un botón con 
          la nueva ACTION <B>ramPlay</B>, y poner en el campo VALUE con el mismo 
          valor que el nombre del objeto media de grabación.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>Interfaz <B>no gráfico</B> 
          con la grabación guardada en un <B>fichero</B>. Para utilizar este 
          modo el autor debe utilizar la nueva ACTION <B>autoRecord </B>y 
          especificar en el campo VALUE el nombre del fichero en el que se va a 
          guardar la grabación. En tiempo de ejecución, la grabación empieza 
          cuando el usuario hace clic, sobre el botón de grabación y termina 
          cuando se hace clic por segunda vez sobre él. Mientras se está 
          realizando la grabación, el botón cambia los colores y en su etiqueta 
          aparece la palabra <B>stop. </B>Cuando la grabación se detiene, se 
          recuperan los colores y la etiqueta del botón originales. </FONT>
          <LI><FONT face="Calisto MT" color=#000000>Interfaz <B>no gráfico 
          </B>con la grabación almacenada temporalmente sólo en memoria 
          <B>RAM</B>. </FONT><FONT face="Calisto MT" color=#000000>Para utilizar 
          este modo, hay que utilizar también la ACTION=<B>autoRecord </B>pero 
          con un valor vacío en el campo VALUE. Sin embargo, hay que especificar 
          un NOMBRE en el objeto media. La grabación funciona exactamente igual 
          que en el caso anterior, salvo que no se guarda en un fichero. Para 
          reproducir la grabación hace falta introducir un nuevo botón con la 
          ACTION <B>ramPlay</B> y poner en el campo VALUE el mismo valor que el 
          nombre indicado en el objeto media de grabación.</FONT> </LI></OL>
        <UL>
          <LI><FONT face="Calisto MT" color=#000000>En los modos 1 y 3 las 
          grabaciones que se hagan durante una sesión, pueden ser reproducidas 
          en sesiones posteriores. Los ficheros se sobreescriben cuando se 
          realiza una grabación sobre ficheros con el mismo nombre.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>En los modos 2 y 4 las 
          grabaciones realizadas (incluso si se hacen en cards diferentes) se 
          mantienen mientras el frame esté activo, pero desaparecen cuando el 
          sistema cambie a otro frame.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>Estos modos de grabación 
          vienen documentados en la <B>plantilla</B> de Grabación 
          modificada.</FONT> 
          <LI><FONT face="Calisto MT" color=#000000>La antigua ACTION 
          <B>winRecord</B> se mantiene, pero ya no se usa más en la plantilla de 
          grabación.</FONT> </LI></UL>
        <P>&nbsp;</P></TD></TR>
    <TR>
      <TD width="100%">
        <P><B>Tamaño y localización del Frame.</B></P>
        <UL>
          <LI>Se ha corregido un error en el tamaño y localización de los 
          popOutFrames de los frames de Malted. El <B>tamaño</B> especificado en 
          la llamada al popOutFrame se tomaba del tamaño de la ventana entera 
          del frame, pero el "centrado" se estaba calculando con respecto al 
          tamaño interno. Ahora, el tamaño especificado es el <B>tamaño interno, 
          </B>pero sin el título ni los bordes. De esta manera es posible 
          especificar de ahora en adelante el tamaño interno. Esto es 
          particularmente importante cuando se está usando <FONT 
          face="Courier New">FITSCREEN=false</FONT>. 
          <LI>Otra modificación es que en todas las veriones anteriores, cuando 
          <FONT face="Courier New">FITSCREEN</FONT> era falso y el tamaño de la 
          vantana era más pequeño que el tamaño de un frame de Malted, entonces 
          éste último no aparecía centrado, con su esquina superior izquierda 
          coincidiendo con la esquina superior izquierda del interior de la 
          ventana. Ahora siempre se muestra centrada. Esto modifica el 
          comportamiento, pero en general el resultado es mejor, especialmente 
          cuando el usuario modifica el tamaño de la ventana. </LI></UL></TD></TR>
    <TR>
      <TD width="100%">
        <P><STRONG>Print</STRONG>.</P>
        <UL>
          <LI>Se ha deasrrollado un nuevo sistema de impresión porque el antiguo 
          resultó ser muy inestable con respecto a las distintas versiones del 
          JRE. El sistema anterior funcionaba bien en JRE 1.1, pero imprimía 
          solamente tonos grises en JRE 1.3.1_01 y 1.4 y fallaba completamente 
          en JRE 1.3.1_02. 
          <LI>El interfaz de usuario es el mismo que antes. El usuario puede 
          llamar a las funciones de impresión para imprimir los contenidos de la 
          pantalla, desde el menú pricipal. Además cuando se hace un clic con el 
          botón derecho del ratón sobre un objeto media, la opción de impresión 
          aparece y si el usuario la selecciona, se imprimen los contenidos del 
          objeto media. Si el objeto media tiene un área de texto, el contenido 
          completo del texto es impreso, de cualquier otro modo se imprime el 
          aspecto visual. 
          <LI>El tamaño de la imagen impresa se calcula para ajustar la pantalla 
          de ejecución de Malted al área de impresión, manteniendo las 
          proporciones de altura y anchura. De esta manera, una pantalla de 
          Malted de 800x600 aparecerá más grande si se imprime con una 
          orientación horizontal, que si se hace con orientación vertical. 
          Cuando se imprime un solo objeto media se sitúa en la parte superior 
          izquierda, del área de impresión y el tamaño es proporcional al área 
          que ocupa en la pantalla. Dicho de otra manera, los objetos media en 
          un frame de Malted son impresos con el mismo tamaño con el que 
          aparecerían si se imprimiese el frame entero. Hay una excepción, ésta 
          se da con la impresión de áreas de texto en sentido vertical, el 
          resultado normalmente consiste en una imagen impresa mayor que lo que 
          ocupa en pantalla. 
          <LI>La función print a la que se accede desde el menú contextual en un 
          "popOutText" imprime el texto entero ajustándolo a la anchura del área 
          de impresión. 
          <LI><B><I>Nota</I></B><I>: </I>Los resultados de la impresión pueden 
          diferir de los obtenidos con JRE 1.1. 
          <LI><B><I>Nota: </I></B>Algunas propiedades de la impresora 
          (particularmente la orientación) deben definirse antes de abrir el 
          cuádro de diálogo de la impresora desde el entorno de ejecución de 
          Malted, de otro modo se ignorarán. Esto no es un error de Malted o de 
          Java. Parece ser más bien un error general de la impresión bajo 
          Windows, ya que el mismo suceso se ha detectado en programas escritos 
          por ejemplo en Delphi. </LI></UL></TD></TR>
    <TR>
      <TD width="100%">
        <P><STRONG>GapFilling</STRONG>.</P>
        <UL>
          <LI>En esta interacción se ha corregido el siguiente error: si se 
          cambiaba de lenguaje en un popOutFrame generado desde un frame 
          GapFilling, cuando se cerraba el frame, la pantalla aparecía 
          completamente revuelta. Este error se debía al uso de un método de 
          refresco anticuado, el cuál ha sido reemplazado por otro en el actual 
          Malted. </LI></UL></TD></TR>
    <TR>
      <TD width="100%">
        <P><B>Interacción Dialog.</B></P>
        <UL>
          <LI>La ACTION <B>RunAllDialog </B>es usada para presentar una barra de 
          desplazamiento indicando el progreso del diálogo. El tamaño y la 
          localización de esta barra, antes se calculaba de manera que ocupase 
          toda la anchura del frame, comenzando en la parte baja del panel y 
          acabando en la parte baja del frame. Solamente las partes de la barra 
          que no eran cubiertas por un objeto media se mostraban, lo que 
          resultaba bastante feo. La barra de desplazamiento se ha eliminado en 
          esta versión porque parece que es de poco uso y resulta visualmente 
          desagradable. </LI></UL></TD></TR>
    <TR>
      <TD width="100%">
        <P><B>Manejo de la Memoria</B></P>
        <UL>
          <LI>Las recientes versiones estaban produciendo algunos errores con la 
          memoria. Eran debidos a una disminución en la frecuencia a las 
          llamadas al recolector de basura. Esto se ha corregido principalmente, 
          llamando al recolector en algunos lugares donde se suprimieron estas 
          llamadas para garantizar una respuesta más rápida a las interacciones 
          con el usuario. 
          <LI>Todas las versiones anteriores mantenían en memoria RAM, los 
          recursos de imágen de todos los cards de todos los paneles en el 
          frame. En la beta 8, esto ya no ocurre, ya que solo se guardan en 
          memoria RAM las imágenes de las cards que están activas. Esto supone 
          tener que pagar un pequeño precio con la RAM, particularmente en 
          frames con varios cards en un panel, como los que se usan en las 
          interacciones Dialog. Esto supone un pequeño impacto en la velocidad 
          con se cambian los cards. 
          <LI>Por todas estas razones, la probabilidad de que suceda un error de 
          fuera de memoria en esta versión beta 8, es notablemente más pequeña 
          que en la beta 7 y mucho menor que en anteriores versiones. Sin 
          embargo es importante hacer que los autores de los cursos de Malted 
          sean conscientes de cuales son los elementos que consumen excesiva 
          memoria y que pueden favorecer este tipo de errores de memoria. 
        </LI></UL>
        <P align=center><B>Elementos que suponen una sobrecarga en los 
        requerimientos de RAM.</B></P>
        <OL>
          <LI>Imágenes grandes. Se entiende por grande, imágenes que ocupan un 
          gran área, aunque vengan en pequeños ficheros. Intente utilizar 
          imágenes pequeñas. Si solo se muestra una parte de a imágen, se 
          recomienda cortarla, para que no ocupe excesiva memoria. 
          <LI>Los modos de grabación 2 y 4, mantienen las grabaciones en RAM. Si 
          un ejercicio tiene muchos cards, con una grabación de audio asociada 
          en cada uno, y estas grabaciones se guardan en RAM, entonces puede 
          producir un error de falta de memoria. Se recomienda que cuando los 
          ejercicios de grabación estén compuestos de muchos cards, se efectúen 
          dichas grabaciones directamente sobre ficheros, para evitar este 
          problema. 
          <LI>Los "popOutFrames" utilizan la parte alta de la memoria usada por 
          el frame desde el que emergen. De esta manera, los frames emergentes 
          de otros frames emergentes no son recomendables. </LI></OL></TD></TR>
    <TR>
      <TD width="100%">
        <P><STRONG>DVE</STRONG>.</P>
        <UL>
          <LI>Hay un editor de texto por defecto, asoicado las extensiones txt, 
          rtf, y ficheros html . Se llama <FONT 
          face="Courier New">write.exe</FONT>. 
          <LI>El menú contextual de un fichero media mostraba el menú 
          correspondiente de un objeto media. Eso se ha corregido y ahora 
          muestra un menú con las opciones: <B>edit, preview, rename</B> y 
  <B>delete.</B> </LI></UL></TD></TR></TBODY></TABLE>
  <P align=center>&nbsp;</P>
  <P style="TEXT-ALIGN: center" align=center><STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 24pt; COLOR: blue">Malted v.2 (beta 6)</SPAN></STRONG><SPAN 
  lang=EN-GB></SPAN></P>
  <P>Asegúrese de leer el fichero <A 
  href="file:///C:/WINDOWS/Archivos%20temporales%20de%20Internet/Content.IE5/4HEFU30D/LICENSE.html" 
  target=_blank>Malted Distribution License</A>.</P>
  <P>Para la instalación lea: <A 
  href="file:///C:/WINDOWS/Archivos%20temporales%20de%20Internet/Content.IE5/4HEFU30D/Install.html" 
  target=_blank>Install.html</A>. </P>
  <DIV align=center>
  <TABLE cellPadding=0 width="80%" border=1>
    <TBODY>
    <TR>
      <TD class=Normal width="100%">
        <P style="TEXT-ALIGN: center" align=center><SPAN 
        style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 
        2 - beta 6 Nuevas funcionalidades y Bugs 
    corregidos</SPAN></P></TD></TR></TBODY></TABLE></DIV>
  <DIV align=center>
  <TABLE cellPadding=0 width="80%" border=1>
    <TBODY>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN style="COLOR: black">Instalación</SPAN></STRONG><SPAN 
        style="COLOR: black">.</SPAN></P>
        <UL type=disc>
          <LI><SPAN style="COLOR: black">Creación de un CD de instalación para 
          los Autores en Malted. Funciona desde un fichero html que proporciona 
          tres ejecutables para la instalación: JRE, JMF and Malted2Setup. 
          </SPAN>
          <LI><SPAN style="COLOR: black">La instalación es completamente 
          automática, en particular no necesita la definición de la variable de 
          entorno CLASSPATH. </SPAN><SPAN lang=EN-GB style="COLOR: black">La 
          misma instalación funciona en todas las versiones de Windows (Desde 
          Windows 95 en adelante).</SPAN><SPAN lang=EN-GB></SPAN> 
          <LI>Los subdirectorios de MALTED_HOME han sido limpiados para incluir 
          sólo los ficheros necesarios en esta entrega. Los ficheros que han 
          sido eliminados no ya no se usan, por lo que deberían ser eliminados 
          de las instalaciones antiguas. 
          <LI>Los dtds y las imagenes del <I>runtime system </I>son incluidas en 
          los fichero <B>malted.jar </B>y <B>MaltedApplet.</B>jar, por lo que ya 
          no es necesario copiarlas en los directorios remotos de los proyectos. 

          <LI>El tamaño de todos los ejecutables de Malted ha sido reducido de 
          180 a 38 Kb. </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Applet</SPAN></STRONG><SPAN 
        lang=EN-GB>.</SPAN></P>
        <UL type=disc>
          <LI>El applet tiene un nuevo formato de llamada desde una página web, 
          que incluye la instalación de JRE, en el caso de que el navegador no 
          entienda Java porque no esté instalado. Detecta el lenguaje del 
          usuario y proporciona todos los mensajes en español si es su lenguaje, 
          si no fuese así los mensajes se mostrarían en inglés. También detecta 
          si el JRE instalado es adecuado para Malted, y si no es así 
          proporciona un link para instalar el JRE correcto. El applet es ahora 
          un “applet firmado”, y por lo tanto pregunta al usuario si le 
          proporciona permisos. Una vez que el applet ha recibido permiso para 
          ejecutarse, verifica si el JMF está instalado y si no es así 
          proporciona un link para realizar la instalación. <BR><SPAN 
          lang=EN-GB>La plantilla para invocar el applet se puede encontrar 
          en:</SPAN> </LI></UL>
        <P style="TEXT-ALIGN: center" align=center><A 
        href="http://www.cnice.mecd.es/malted/ingles/"><SPAN 
        lang=EN-GB>http://www.cnice.mecd.es/malted/ingles/</SPAN></A><SPAN 
        lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB>El applet firmado esencialmente tiene la misma 
          funcionalidad que el RTS con la excepción de los siguientes 
          detalles:</SPAN> 
          <OL type=1>
            <LI>Cuando los botones <I>edit course </I>y <I>edit frame </I>están 
            presentes en el modo remoto, el applet muestra un mesaje en el que 
            dice que la edición no está permitida en modo remoto. 
            <LI><SPAN lang=EN-GB>La accion </SPAN><SPAN lang=EN-GB 
            style="FONT-FAMILY: Courier">execute</SPAN><SPAN lang=EN-GB> no 
            funciona en el applet.</SPAN> </LI></OL>
          <LI>El applet muestra su fecha y sello temporal en la Consola Java. 
          Esto se hace para proporcionar al usuario información sobre la versión 
          que está usando y para así facilitar la notificación de posibles 
          problemas.<SPAN lang=EN-GB></SPAN> 
          <LI><SPAN lang=EN-GB>El applet permite la edición de frames y cursos 
          cuando está ejecutandose en modo local.</SPAN> 
          <LI><SPAN lang=EN-GB>No es necesario editar el fichero security.policy 
          para que funcione el applet.</SPAN> 
          <LI>El <STRONG>menu</STRONG> del MaltedApplet es configurable del 
          mismo modo que el menu del RTS. </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Runtime.</SPAN></STRONG><SPAN 
        lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB>Se ha desarrollado un nuevo ejecutable 
          <STRONG>MaltedRTSFullScreen</STRONG>. Funciona del mismo modo que 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">RTSFullScreen.bat</SPAN><SPAN lang=EN-GB> 
          pero sin abrir una ventana del interprete de comandos.</SPAN> 
          <LI><SPAN lang=EN-GB>En Windows es posible asociar la extensión 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier"><STRONG>.cxml</STRONG></SPAN><SPAN 
          lang=EN-GB> a uno de los ejecutables: <STRONG>MaltedRTS</STRONG>, 
          <STRONG>MaltedRTE</STRONG> or <STRONG>MaltedRTSFullScreen</STRONG> 
          para que con un doble click en un fichero de dicha extensión (si la 
          localización del ejecutable es la correcta) ejecute el curso.</SPAN> 
          <LI><SPAN lang=EN-GB>El <STRONG>RTSFullScreen</STRONG> tiene un botón 
          de minimizar.</SPAN> 
          <LI><SPAN lang=EN-GB>Cuando las ventanas de malted se minimizan la 
          barra de herramientas muestra el icono de malted.</SPAN> 
          <LI><SPAN lang=EN-GB>Se ha mejorado el display de un nuevo frame. En 
          el caso de displays centrados la imagen se muestra centrada desde un 
          primer momento.</SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">La acción winEMail ha sido 
          mejorada. Se ha solucionado un bug para que funcione con el Outlook. 
          Ahora es posible mandar los contenidos de un text media object 
          escribiendo "MEDIA.medianame.TEXT.", donde "medianame" debe ser 
          sustituido por el nombre del media object. El VALUE de la accion debe 
          ser escrito del siguiente modo:</SPAN> </LI></UL>
        <P><SPAN lang=EN-GB 
        style="COLOR: black; FONT-FAMILY: Courier">mailto:myTutor@server.country?body=MEDIA.medianame.TEXT.</SPAN><SPAN 
        lang=EN-GB></SPAN></P>
        <P><SPAN lang=EN-GB style="COLOR: black">El punto final es necesario 
        debido a razones técnica. Un ejemplo de esta acción puede verse en la 
        plantilla <STRONG>freeWriting</STRONG>. En esta plantilla </SPAN><SPAN 
        lang=EN-GB 
        style="COLOR: black; FONT-FAMILY: Courier">medianame=message</SPAN><SPAN 
        lang=EN-GB style="COLOR: black">.<BR>Todo esto que acabamos de comentar 
        funciona bien tanto en Eudora como en Outlook. Sin embargo Eudora 
        permite la inclusión de la cadena de texto "?subject=whatever...", en el 
        caso de Outlook, éste solo interpreta uno de los parámetros, por lo que 
        debe escogerse entre incluir un asunto o un cuerpo al correo, pero no 
        ambos. En Outlook, si se usan ambos parámetros, todo se incluye en el 
        parámetro que aparece primero.</SPAN><SPAN lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB style="COLOR: black">El tamaño, localización y 
          título de un <STRONG>popOutFrame</STRONG> puede ser controlado por el 
          autor. Para hacer esto, al final del VALUE debe ser incluida esta 
          información entre comillas dobles, por ejemplo:</SPAN><SPAN 
          lang=EN-GB></SPAN> </LI></UL>
        <P><SPAN lang=EN-GB 
        style="COLOR: black; FONT-FAMILY: Courier">"320x240,300,10,myTitle"</SPAN><SPAN 
        lang=EN-GB></SPAN></P>
        <P><SPAN lang=EN-GB style="COLOR: black">Todas las comas son necesarias, 
        lo que va entre ellas puede ser omitido, y el programa se encarga de 
        rellenar el valor con el valor por defecto.<BR>Podemos encontrar un 
        ejemplo en la ventana "indo" de la plantilla 
        <STRONG>Transcription</STRONG>.</SPAN><SPAN lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB style="COLOR: black">El título de un 
          <STRONG>popOutText</STRONG> puede ser modificado por el autor. Para 
          hacer esto, al final del VALUE uno puede añadirlo entre comillas 
          dobles, por ejemplo:</SPAN><SPAN lang=EN-GB 
          style="COLOR: black; FONT-FAMILY: Courier"> "myTitle". </SPAN><SPAN 
          lang=EN-GB style="COLOR: black"><BR>Podemos encontrar un ejemplo en 
          las ventanas "key" de la plantilla 
          <STRONG>Transcription</STRONG>.</SPAN><SPAN lang=EN-GB></SPAN> 
      </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Audio</SPAN></STRONG><SPAN 
        lang=EN-GB>.</SPAN></P>
        <UL type=disc>
          <LI>Los ficheros <SPAN lang=EN-GB>Midi daban problemas debido a un 
          error en las instalaciones del JRE y JMF. Un nuevo procedimiento ha 
          sido programado para eliminar este problema. El procemimiento busca el 
          fichero "soundbank.gm" que no se proporciona en la instalación del 
          JRE, y se coloca en un lugar equivocado por la instalación del JMF. 
          Una vez localizado este fichero se copia a su ubicación correcta. Esto 
          se realiza de forma automática la primera vez que se reproduce un 
          fichero Midi.</SPAN> 
          <LI>Los ficheros <SPAN lang=EN-GB>mp3 localizados en direcciones web 
          no se reproducían de forma completa, se cortaba el último segundo. 
          Esto ha hecho necesaria una modificación del sistema de caché en la 
          ejecución remota (véase <STRONG>Cache)</STRONG>. El problema ya está 
          solucionado.</SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Cache.</SPAN></STRONG><SPAN 
        lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB>Un nuevo sistema de caché se ha desarrolado para 
          la ejecución remota tanto del applet como del RTS. El sistema crea un 
          subdirectorio "Malted_cache" del directorio de usuario. Casi todos los 
          ficheros remotos se descargan y copian a este subdirectorio. Todo el 
          uso de estos fichero se hace directamente desde la caché. Cuando los 
          ficheros llevan más de 2 horas en la caché, el sistema que gestiona la 
          caché se encarga de chequear si el fichero original ha sido cambiado y 
          si es así descargar la nueva versión. Si el fichero no ha sido 
          cambiado se actualiza el sello temporal del fichero y no se vuelve a 
          comprobar si hay actualizaciones hasta dentro de dos horas. Los 
          ficheros mp3 de más de 50Kb los ficheros mpeg de más de 1MB no se 
          descargan, si no que se reproducen por streaming.</SPAN> 
          <LI><SPAN lang=EN-GB>El usuario puede eliminar el directorio 
          Malted_cache en cualquier momento para liberar espacio. Una política 
          de gestión automática de la cache puede ser desarrollada en el 
          futuro.</SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB style="COLOR: black">Mouse 
        Cursor.</SPAN></STRONG><SPAN lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB style="COLOR: black">El comportamiento en general 
          del cursor ha sido mejorado.</SPAN><SPAN lang=EN-GB></SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">El cursor de espera aparece 
          mientras el programa está abriendo un nuevo frame.</SPAN><SPAN 
          lang=EN-GB></SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">El cursor con forma de mano 
          ahora aparece sobre objetos media cuando tienen un AUDIO, VIDEO, 
          ACTION o VALUE.</SPAN><SPAN lang=EN-GB></SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">El cursor de arrastre no 
          desaparece como lo estaba haciendo en las interacciones de arrastrar y 
          soltar (drag &amp; drop).</SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Interactions.</SPAN></STRONG><SPAN 
        lang=EN-GB></SPAN></P>
        <UL type=disc>
          <LI>En la interacción de <SPAN lang=EN-GB><STRONG>Gapfilling</STRONG> 
          ahora es posible navegar entre los distintos huecos con el tabulador. 
          En la versión anterior no era siempre posible.</SPAN> 
          <LI><SPAN lang=EN-GB>En el <STRONG>GapFilling</STRONG> hay dos nuevos 
          parámetros: </SPAN><STRONG><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">gapPad</SPAN></STRONG><SPAN lang=EN-GB> y 
          </SPAN><STRONG><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">autoJump</SPAN></STRONG><SPAN 
          lang=EN-GB>. </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">gapPad</SPAN><SPAN lang=EN-GB> permite 
          definir el número extra de espacios que se añadirán a un hueco, por 
          encima del espacio definido en gapSize. El valor por defecto es 1. 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">autoJump</SPAN><SPAN lang=EN-GB> es un 
          valor booleano con valor por defecto </SPAN><STRONG><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">no</SPAN></STRONG><SPAN lang=EN-GB>. Si 
          el valor es </SPAN><STRONG><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">yes</SPAN></STRONG><SPAN lang=EN-GB>, 
          entonces cuando el cursos alcanza el tamaño del hueco salta al 
          siguiente hueco.</SPAN> 
          <LI><SPAN lang=EN-GB>La interacción <STRONG>Order</STRONG> ha sido 
          modificada. Anteriormente cuando se arrastraba y soltaba una frase o 
          palabra en el lugar de otra, entonces la segunda pasaba a ocupar el 
          lugar de la primera, es decir, se intercambiaban las posiciones de las 
          palabras o frases. En esta versión la ordenación se hace por 
          <EM>inserción</EM>, es decir, las palabras o frases son desplazadas 
          para acomodarse a la que ha sido movida, manteniendo siempre su 
          ordenación relativa.</SPAN> 
          <LI><SPAN lang=EN-GB>En <STRONG>MultipleChoice</STRONG>, cuando se 
          usan check boxes, un click en el botón cambia el estado del checkbox 
          de igual forma que si se hubiese hecho click en el checkbox.</SPAN> 
          <LI><SPAN lang=EN-GB>La interacción <STRONG>Match2</STRONG> tiene tres 
          nuevos parámetros: </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">markUsed</SPAN><SPAN lang=EN-GB>, 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">markedFGCOLOR</SPAN><SPAN lang=EN-GB> y 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">markedBGCOLOR</SPAN><SPAN lang=EN-GB>. El 
          último solo tiene significado cuando m</SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">arkUsed=yes</SPAN><SPAN lang=EN-GB>. En 
          este caso las opciones que han sido usadas una vez cambian su color y 
          su color de fondo, de acuerdo con los valores de los parámetros 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">markedFGCOLOR</SPAN><SPAN lang=EN-GB> y 
          </SPAN><SPAN lang=EN-GB 
          style="FONT-FAMILY: Courier">markedBGCOLOR</SPAN><SPAN lang=EN-GB>. 
          Podemos encontrar un ejemplo de esta nueva funcionalidad en la 
          plantilla Match_000.template (Drag and Drop).</SPAN> 
          <LI><SPAN lang=EN-GB>La acción <STRONG>setLang</STRONG> ha sido 
          mejorada. Ahora, cuando se ejecuta en el medio de una interacción, 
          cambia todos los cotenidos media para aquellos media que no 
          intervienen en la interacción. En la recarga todos los contenidos de 
          los medias se traducen. Por lo tanto, si un curso está diseñado de tal 
          forma que se usan varios lenguajes, en los objetos media informativos 
          la traducción se lleva a cabo de forma inmediata.</SPAN> 
          <LI><SPAN lang=EN-GB>Si la acción <STRONG>setLang</STRONG> se ejecuta 
          en un <STRONG>popOut</STRONG> frame o en un course, cuando éste se 
          cierra, el nuevo idioma se usa de forma inmediata en el frame activo 
          como si la acción setLang se hubiese llamado desde él. Por lo tanto es 
          posible hacer que un idioma cambie usando un popOut con este 
          propósito.</SPAN> 
          <LI><SPAN lang=EN-GB>Las acciones <STRONG>verify</STRONG> y 
          <STRONG>check</STRONG> han sido uniformizadas tanto como ha sido 
          posible y la nueva acción de verificación <STRONG>solve</STRONG> ha 
          sido desarrollada.<BR>La acción <STRONG>verify</STRONG> muestra las 
          respuestas correctas en el color "correct" y las respuestas 
          incorrectas en el color "wrong", pero no proporciona las respuestas 
          correctas.<BR>La acción <STRONG>check</STRONG> elimina las respuestas 
          incorrectas y marca las correctas.<BR>La acción <STRONG>solve</STRONG> 
          muestra las respuestas correctas siempre, mostrando en el color 
          "correct" las que estaban escritas de forma correcta, y en el color 
          "wrong" las que no lo estaban.<BR><STRONG>verify</STRONG> y 
          <STRONG>check</STRONG> funcionan en GapFilling, Crossword2, Crossword 
          y MultipleChoice.&nbsp; La acción <STRONG>solve</STRONG> funciona solo 
          en el GapFilling y Crossword2.</SPAN> 
          <LI><SPAN lang=EN-GB>En Crossword y Crossword2 la acción 
          <STRONG>verify</STRONG> ha sido modificada como se acaba de 
          explicar.</SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">La ventana de puntuación 
          ahora tiene como título "Score" en lugar de "Malted 
          message".</SPAN><SPAN lang=EN-GB></SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><SPAN lang=EN-GB>Bugs en las<STRONG> Interacciones</STRONG> que han 
        sido corregidos.</SPAN></P>
        <UL type=disc>
          <LI><SPAN lang=EN-GB>La acción verify algunas veces habría dos 
          ventanas de mensaje. </SPAN>
          <LI><SPAN lang=EN-GB>La interacción del ahorcado (Hangman) no 
          funcionaba con popOut frames y en la previsualización del DVE.</SPAN> 
          <LI><SPAN lang=EN-GB>Los tamaños de los objetos media no se trataban 
          de forma correcta en las asociaciones y acciones de arrastrar y soltar 
          (drag &amp; drop). Algunas veces una asociación correcta podía ser 
          desechada. Soltar un objeto en algún lugar podía resultar en su 
          posicionamiento otro lugar próximo.</SPAN> 
          <LI><SPAN lang=EN-GB>Los sonidos Correct y Wrong a veces no se 
          reproducían en la interacción Multiple Choice.</SPAN> 
          <LI><SPAN lang=EN-GB>En el Gapfilling el cambio de tamaño de las 
          ventanas podía provocar un fallo en el cambio de tamaño de los 
          huecos.</SPAN> 
          <LI><SPAN lang=EN-GB>En el Gapfilling hay un error en el calculo de 
          los huecos cuando el gapSize=0. Ahora funciona de forma correcta, 
          calculando el tamaño correcto de cada hueco de acuerdo con la opción 
          mayor.</SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>Cursos.</SPAN></STRONG></P>
        <UL type=disc>
          <LI>La variable <SPAN lang=EN-GB><STRONG>score</STRONG> de los frames, 
          usada en los links condicionales se inicializa con el valor -1 en vez 
          de 0, para diferenciar la situación en la que el estuciante no ha 
          hecho click el botón de verificación de la situación en la que la 
          puntuación es realmente cero.</SPAN> </LI></UL></TD></TR>
    <TR>
      <TD class=Normal width="100%">
        <P><STRONG><SPAN lang=EN-GB>DVE</SPAN></STRONG><SPAN 
        lang=EN-GB>.</SPAN></P>
        <UL type=disc>
          <LI>Cuando se crea un nuevo frame, los <SPAN lang=EN-GB 
          style="COLOR: black"><STRONG>assets </STRONG>necesarios se 
          <STRONG>importan de forma automática.</STRONG></SPAN> 
          <LI><SPAN lang=EN-GB style="COLOR: black">La acción <STRONG>open 
          project</STRONG> abre un <STRONG>explorador de archivos </STRONG>que 
          muestra con un icono especial aquellos directorios que son proyectos 
          de Malted. El usuario puede selecionar cualquiera de estos proyectos 
          en cualquier lugar. Se pueden editar cursos en cualquiera de estos 
          proyecots.<BR>Falta un problema por resolver, no es posible impedir la 
          navegación en el directorio de un proyecto. Sin embargo los iconos 
          para proyectos reducen este problema.</SPAN> 
          <LI><SPAN lang=EN-GB>Ahora es posible <STRONG>importar frames o 
          cursos</STRONG> desde un proyecto en <STRONG>cualquier lugar</STRONG>. 
          (En versiones previas esto sólo era posible desde 
          Malted/projects)..</SPAN> 
          <LI><SPAN lang=EN-GB>En la previsualización de los frames con 
          interacciones que tengan un botón "verify", las interacciones no 
          funcionaban bien. Este bug ha sido solucionado.</SPAN> 
    </LI></UL></TD></TR></TBODY></TABLE></DIV>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 5 Nuevas Funcionalidades</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">Hay dos nuevas 
  <STRONG>condiciones</STRONG> para los links de cursos: 
  <STRONG>frameVariable</STRONG> y <STRONG>courseVariable</STRONG>. Los valores 
  posibles para esos links son aquellos recogidos en cualquier <STRONG>variable 
  de curso </STRONG>o<STRONG> variable de frame</STRONG>. Los valores de las 
  variables se establecen usando una de las dos nuevas acciones para medias: 
  <STRONG>setFrameVariable</STRONG> y <STRONG>setCourseVariable</STRONG>. Las 
  variables de curso se mantienen durante todo el curso, mientras que las 
  variables de frame se mantienen sólo durante el tiempo de vida del frame. Por 
  ejemplo, se pueden usar en un media la acción 
  <STRONG>setCourseVariable(sex=Female)</STRONG> y el valor de esta variable 
  puede usarse en cualquier link del curso con <EM>Condition</EM> con valor 
  <STRONG>courseVariable</STRONG> y <EM>Value</EM> con valor 
  <STRONG>sex=Female</STRONG> o<STRONG> sex!=Female</STRONG>. Las variables 
  pueden ser cadenas de caracteres o números. Por ejemplo, en un media se puede 
  establecer un <EM>Action</EM> a <STRONG>setFrameVariable</STRONG> y el 
  <EM>Value</EM> a<STRONG> clicks+1</STRONG> (lo que significa el incremento en 
  uno del valor de la variable <STRONG>clicks</STRONG>). Las variables 
  <EM>numéricas</EM> se inicializan a cero y las variables de <EM>cadenas de 
  texto</EM> se inicializan con cadenas de texto vacías. En la condición de un 
  link en un curso se puede establecer <EM>Condition</EM> a 
  <STRONG>frameVariable</STRONG> y <EM>Value</EM> a<STRONG> clicks=0</STRONG>, 
  <STRONG>clicks&lt;=4</STRONG> o<STRONG> clicks&gt;4</STRONG> por ejemplo. Se 
  incluye un nuevo proyecto <STRONG>CourseExamples</STRONG> en esta entrega, que 
  contiene dos cursos: <STRONG>Characters.cxml</STRONG> y 
  <STRONG>Clicks.cxml</STRONG> que muestra ejemplos de uso de estas nuevas 
  condiciones.</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG></STRONG><SPAN lang=EN-GB style="COLOR: black">La 
  interacción <STRONG><SPAN lang=EN-GB style="COLOR: black">Transcription 
  </SPAN></STRONG>no estaba trabajando de forma correcta. El problema estaba en 
  la forma en que algunos textos se manejaban, y estaba afectando&nbsp;a otros 
  aspectos. Este problema ha sido solucionado.</SPAN><SPAN 
lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">El el 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ahora es posible 
  trabajar con proyectos localizados en cualquier directorio del ordenador. La 
  acción "Open Project" permite navegar para seleccionar donde quiere el usuario 
  crear el nuevo proyecto.</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>En el DVE</SPAN></STRONG><SPAN 
  lang=EN-GB> a veces no era posible seleccionar la acción de un media, el 
  problema está solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>En el DVE</SPAN></STRONG><SPAN 
  lang=EN-GB> cambiar el nombre de un frame causaba problemas en algunas 
  situaciones, el problema está solucionado.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 4.3 Nuevas Funcionalidades/Bugs Solucionados</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">En el 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> los <STRONG>nuevos 
  proyectos</STRONG> se crean sin ningún media. Los media de las plantillas ya 
  no son copiados.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">En 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> el <STRONG>font 
  style</STRONG> se establecía de forma erronea como PLAIN. El problema ya está 
  solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción de 
  Gapfilling</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ha sido 
  modificada. Ahora los huecos usan el atributo </SPAN><SPAN 
  lang=EN-GB><STRONG>alignment</STRONG> del objeto media.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</SPAN></SPAN><STRONG><SPAN 
  lang=EN-GB style="COLOR: black">La interacción HangMan</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black"> se resetea cuando se cambia el 
  idioma.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 4.2 Nuevas Funcionalidades/Bugs Solucionados</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción 
  Crossword2</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ha sido 
  reprogramada. Ahora tiene tres nuevos parámetros: </SPAN><SPAN 
  lang=EN-GB><STRONG>ActiveBorderColor</STRONG>, <STRONG>CorrectColor</STRONG>, 
  <STRONG>WrongColor</STRONG> para configurar el color del borde del rectángulo 
  activo, el color de las respuestas correctas en el <EM>verify</EM> o<EM> 
  check, </EM>y el color de las incorrectas en el <EM>verify</EM>, 
  respectivamente. También es posible tener crucigramas con distinto número de 
  filas y columnas.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción 
  Match2</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ha sido 
  reprogramada para el caso en el que hay asociaciones. Las asociaciones ahora 
  se realizan con flechas en vez de líneas, ahora hay dos nuevos parámetros 
  </SPAN><SPAN lang=EN-GB><STRONG>arrowColor</STRONG> y<STRONG> 
  arrowWidth</STRONG> para configurar el coloro y ancho de la flecha. En algunas 
  situaciones se lanzaba una excepción, este problema ya ha sido 
  solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB>Las áreas de texto en los media cortaban 
  algunas palabras. Este problema ya está solucionado.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 4.1 Bugs Solucionados</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">La animación lanzaba un 
  error. El problema está solucionado.</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">La acción setLang no 
  estaba funcionando de forma correcta en objetos media con áreas de texto. El 
  problema está solucionado.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 4 Nuevas Funcionalidades</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">Los mensajes del sistema 
  (incluidas los botones de respuesta Yes, No, Ok) pueden ser editados en un 
  fichero externo llamado <STRONG>config/msg.properties</STRONG>. Los mensajes 
  traducidos pueden ser editados en los ficheros correspondientes, por ejemplo: 
  <STRONG>config/msg_es.properties</STRONG>, 
  <STRONG>config/msg_ca.properties</STRONG>.</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">En el 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">, la modificación del 
  comportamiento del frame provocaba la perdida de datos. Este problema está 
  solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">En el 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">, los valores de los 
  parámetros se cambiaban de forma aleatoria. Este problema está 
  solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">El menú del 
  DVE</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> carecía de dos 
  acciones:<STRONG> Close Project</STRONG> y <STRONG>Import Frame</STRONG>. El 
  fichero menu.xml ha sido modificado para solucionar esto.</SPAN><SPAN 
  lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</SPAN></SPAN><STRONG><SPAN 
  lang=EN-GB style="COLOR: black">La interacción 
  MultipleChoice</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ahora 
  tiene un nuevo parámetro: <STRONG>checkOnlyOne</STRONG>. Su valor por defecto 
  es <STRONG>no</STRONG> (para mantener la compatibilidad hacia atrás). 
  Si<STRONG> checkOnlyOne</STRONG>=<STRONG>no</STRONG> puede haber varias 
  respuestas correctas y el usuario puede seleccionarlas. Incluso cuando sólo 
  hay una respuesta correcta, es posible contabilizar como un fallo cuando el 
  usuario selecciona varias respuestas. Con<STRONG> checkOnlyOne=yes</STRONG>, 
  el usuario puede seleccionar sólo una respuesta en cada grupo de respuestas. 
  Este nuevo comportamiento puede verse en funcionamiento en: 
  </SPAN><STRONG><SPAN lang=EN-GB>MCh_MQ_anyTime.template</SPAN></STRONG><SPAN 
  lang=EN-GB>.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción 
  MatchDnd</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> y su plantilla 
  no estaban presentes en entregas pasadas, causando problemas en algunos 
  frames. Ya vuelven a estar presentes en eta entrega.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción 
  GapFilling</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ahora usa el 
  "media alignment appearance" para el texto con huecos. Sin embargo, el 
  alinemaiento no se usa <U>nunca</U> en los huecos.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La interacción 
  Crossword2</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> ahora usa los 
  colores del objeto media denominado <STRONG>Crossword</STRONG>. Éste usa 
  colores de primer plano y de fondo en las casillas inactivas. Los colores se 
  invierten para las casillas vacías. La casilla activa tiene un borde rojo. 
  Debido a que el azul y el rojo se usan para indicar las letras correctas e 
  incorrectas, no es conveniente usar estos colores como color de primer plano o 
  color de fondo. También hay una nueva funcionalidad para los<STRONG> 
  "multimedia crosswords"</STRONG>, si hay medias denominados 
  <STRONG>Across</STRONG> y/o<STRONG> Down</STRONG>, las "multimedia 
  definitions" se presentan allí. Al final de la linea de una definición puede 
  haber un "pipe" ( | ) y a continuación un texto que se convertirá en la 
  etiqueta del media, o una inagen, autio o texto y empieza con las subcadenas 
  "image/", "audio/" o "text/" respectivamente. Vamos a mostrar unos ejemplos de 
  etiquetas e imagenes: <BR><BR></SPAN><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; FONT-FAMILY: 'Courier New'">3.Temperature (abbr.)|3 
  down<BR>&nbsp; 4.During this season, it gets coulder and leaves turn 
  color|image/fall.jpg</SPAN><SPAN lang=EN-GB 
  style="FONT-FAMILY: 'Courier New'"><BR><BR></SPAN><SPAN lang=EN-GB>El 
  comportamiento de este cruzigrama multimedia se muestra en la plantilla 
  Crossword2_000.template. Presten especial atiención a las imagenes en el 4 y 
  19 vertical.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 3 Nuevas Funcionalidades</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">En las acciones 
  del</SPAN></STRONG><STRONG><SPAN lang=EN-GB style="COLOR: black"> DVE 
  </SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">asociadas con eventos 
  pueden ser seleccionadas usando un menú desplegable 
  (<STRONG>drop-down</STRONG>). Previamente hay que escribir la acción de forma 
  explícita. Las acciones aparecen ordenadas alfabéticamente en los menus 
  desplegables.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">En el DVE, los 
  <STRONG>resize</STRONG> y <STRONG>move</STRONG> de containers y medias han 
  sido mejorados. Ahora el resize y move puede realizarse en todos los lados. El 
  cursor del ratón se convierte en un <STRONG>resize</STRONG> cuando está en la 
  parte exterior del borde amarillo y se convierte en un <STRONG>move</STRONG> 
  cuando está en la parte interior del borde amarillo. Los cursores de resize y 
  move cursors no funcionaban siempre de forma correcta en los bordes de los 
  free-media en versiones previas. El problema ya está solucionado. </SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">Fuentes de 
  texto</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">. Es posible el uso 
  de fuentes adicionales. Éstas deben encontrarse en formato TTF en el 
  subdirectorio </SPAN><STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">fonts</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black"> del directorio </SPAN><STRONG><SPAN 
  lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">MALTED_HOME</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black">.&nbsp; (Es importante asegurarse que el 
  usuario final tiene las mismas fuentes que el autor en el directorio 
  </SPAN><STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">MALTED_HOME/fonts</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black">). El DVE ofrece las fuentes que encuentra en 
  el directorio&nbsp; </SPAN><STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">MALTED_HOME/fonts</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black">.</SPAN><SPAN lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">El <STRONG>menú DVE 
  </STRONG>puede configurarse a través del fichero de configuración 
  </SPAN><STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">config/menu.xml</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black">. Se proporciona una nueva configuración. El 
  fichero es suficientemente autoexplicativo, y debería ser fácil de usar para 
  definir un menú de un DVE en un entorno específico (la antigua configuración 
  se proporciona en el fichero </SPAN><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">config/menu(DVE_OLD).xml</SPAN><SPAN 
  lang=EN-GB style="COLOR: black">)</SPAN><SPAN lang=EN-GB>.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB 
  style="COLOR: black">AutoActions</SPAN></STRONG><SPAN lang=EN-GB 
  style="COLOR: black">:</SPAN><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: black"> </SPAN><SPAN lang=EN-GB 
  style="COLOR: black">Cuando un frame o card se muestra, se puede llevar a cabo 
  una acción. Esto puede ser seleccionado en un nuevo campo del menu denominado 
  <STRONG>AutoActions</STRONG> tanto en el dialogo de edición de comportamientos 
  (para unframe) como en el dialogo de edición de cards (para un card). La 
  AutoAction de un card se ejecuta cada vez que éste se muestra. Si un frame 
  tiene uno o más paneles y el primer card tiene AutoActions, estos se ejecutan 
  de forma simultánea con el AutoAction del frame cuando éste es 
  cargado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">IgnoreCase 
  </SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">es un nuevo parámetro de 
  la interacción del GapFilling. Su valor por defecto es <STRONG>no</STRONG> 
  (para preservar la compatibilidad hacia atrás). Cuando el valor de este 
  parámetro es yes, entonces las comparaciones con las respuestas correctas se 
  realizan tratando mayúsculas y minúsculas de igual modo.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB 
  style="COLOR: black">Contractions</SPAN></STRONG><SPAN lang=EN-GB 
  style="COLOR: black">. La interacción de GapFilling tiene un nuevo parámetro 
  denominado <STRONG>equivStrings</STRONG>. Para poder usuarlo el autor tiene 
  que asignarle un fichero, por ejemplo <STRONG>text/contractForms.txt</STRONG> 
  . El fichero debe contener una cadena en cada línea. Dos cadenas consecutivas 
  se consideran equivalentes por el ejercicio de gap filling. El fichero 
  <STRONG>text/contractForms.txt </STRONG>proporcionado en las plantillas 
  contiene todas las formas contraídas en inglés en minúsculas y las que 
  empiezan por una mayúscula. Por lo que trabajarán de forma correcta tanto con 
  el<STRONG> ignoreCase</STRONG> con valor <STRONG>yes</STRONG> como con el 
  <STRONG>ignoreCase</STRONG> con valor <STRONG>no.</STRONG> Este fichero se usa 
  en la nueva plantilla de gap filling denominada 
  <STRONG>TextGapsWithContractions.template</STRONG>.</SPAN><SPAN 
  lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB 
  style="COLOR: black">Order</SPAN></STRONG><SPAN lang=EN-GB 
  style="COLOR: black">. Una nueva interacción ha sido desarrollada. El 
  estudiante puede ordenar objetos media (con etiquetas de texto, imágenes, 
  sonido o vídeo) arrastrando uno y soltándolo en el lugar de otro. El objeto 
  que estaba en el lugar que se ha soltado pasa a ocupar el antiguo lugar del 
  objeto arrastrado. </SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">Print 
  Screen</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">. La opción de 
  impresión del menú del RTS no estaba funcionando de forma adecuada en 
  versiones previas. Ahora funciona de forma correcta. Nota: algunos drivers de 
  impresora no funcionan bien con Java.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">Print. 
  </SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">Cuando el usuario hace 
  un click con el botón derecho en un área de texto o en cualquier objeto media, 
  un pequeño menú aparece, que tiene las opciones <STRONG>print</STRONG> / 
  <STRONG>dictionary. </STRONG>En un texto de popup el menu ofrece tan sólo la 
  opción <STRONG>print</STRONG>. Si el usuario selecciona la opción de impresión 
  los contenidos del media o del área de texto se envían a la impresora. Si la 
  impresora está correctamente configurada esto provoca la aparición del diálogo 
  de impresión.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">Verify 
  messages.</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> El mensaje 
  "you must do all the exercises" y similares, que indican al usuario que no 
  puede realizar la verificación sin completar el ejecicio, no eran uniformes. 
  Ahora son todos los mismos en todas las interacciones y el programa muestra 
  mensajes distintos en función de que existan una o varias cards.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">La 
  gravación</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> se realiza en 
  el subdirectorio de caché del directorio MALTED_HOME. Esto se realiza de forma 
  automática, el autor no puede hacer nada para modificar este comportamiento (a 
  no ser que se proporcionen ficheros de audio vacios en el directorio de 
  proyecto para engañar al DVE y al RTS). Cuando se va a reproducir un fichero 
  de audio por el RTS, éste lo busca en primer lugar en la caché. Sólo si no 
  encuentra el fichero en la caché va al directorio del proyecto en su búsqueda. 
  Por esta razón es importante tener ficheros de audio vacios para las 
  grabaciones en el proyecto. Estos ficheros vacíos no se sobreescribirán con 
  las grabaciones, y se reproducirán sólo si no se ha realizado aún el 
  ejercicion de grabación. En el futuro el directorio de caché puede separar las 
  grabaciones de diferentes usuarios, para que puedan ser usados por los tutores 
  para evaluar la pronunciación de sus alumnos.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">Las interacciones 
  <STRONG>Hangman</STRONG> y <STRONG>Crossword</STRONG> no estaban documentadas 
  en el dialogo de edición de interacciones en el DVE. Ahora ya lo están. 
  </SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">El 
  Crossword</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">. tiene dos 
  nuevos parámetros:<STRONG> check</STRONG> y <STRONG>verify</STRONG> con 
  valores <STRONG>anyTime</STRONG> y<STRONG> atEnd</STRONG>. Cuando el valor es 
  <STRONG>atEnd</STRONG> los botones no funcionan, si se pulsan antes de 
  finalizar el ejercicio, un cuadro de diálogo es mostrado indicándole al 
  usuario que debe finalizar el ejercicio antes de verificarlo.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB 
  style="COLOR: black">Crossword2</SPAN></STRONG><SPAN lang=EN-GB 
  style="COLOR: black">. Hay una nueva interacción para los crucigramas. La 
  interacción permite el movimiento con las flechas del teclado, y las 
  respuestas deben ser escritas en su lugar. Las casillas contienen los números 
  de las definiciones, de igual manera que se hace en los puzzles-crucigramas de 
  inglés. Hay dos objetos media en la plantilla. El primero contiene la rejilla 
  del crucigrama con la que el usuario interactúa. El segundo muestra las 
  definiciones horizontales y verticales, correspondientes a la localización del 
  cursor en cualquier momento. Esta interacción tien botones 
  <STRONG>check</STRONG> y <STRONG>verify</STRONG>.&nbsp;El botón 
  <STRONG>check</STRONG> borra las letras incorrectas, y muestra en color azul 
  las correctas. El botón de </SPAN><SPAN lang=EN-GB 
  style="COLOR: black"><STRONG>verify</STRONG> proporciona la respuesta 
  correcta, poniendo en rojo lo errores y en azul las letras correctas. 
  </SPAN><SPAN lang=EN-GB style="COLOR: black">De igual forma que en la otra 
  interacción de crucigrama, hay dos parámetros <STRONG>check</STRONG> y<STRONG> 
  verify</STRONG> con valores <STRONG>anyTime</STRONG> y <STRONG>atEnd</STRONG>. 
  Cuando el valor es <STRONG>atEnd</STRONG> los botones no funcionan; en caso de 
  que se haga click antes de finalizar el ejercicio, una ventana aparece 
  indicando al usuario que debe finalizar el ejercicio antes de verificar o 
  chequear. . Esta nueva interacción se muestra en una nueva plantilla. Para 
  crear un ejercicio, el autor tiene que escribir toda la información en un 
  fichero de texto. A continuación se muestra un fichero de texto ejemplo 
  proporcionado en las plantillas.</SPAN></P>
  <p> <font face="Courier New"><small>TheWeather.txt</small><big><br>
</big><small>_______________________________________________________________________________<br>
  9x9<br>
  [&nbsp; ]*[ 1]H[ 2]O[ 3]T[&nbsp; ]*[ 4]F[ 5]E[ 6]D[&nbsp; ]*<br>
  [ 7]G[&nbsp; ]A[&nbsp; ]L[&nbsp; ]E[&nbsp; ]*[ 8]A[&nbsp; ]I[&nbsp; ]R[ 9]Y<br>
  [10]N[&nbsp; ]I[&nbsp; ]*[11]M[&nbsp; ]I[&nbsp; ]L[&nbsp; ]*[12]O[&nbsp; ]E<br>
  [13]C[&nbsp; ]L[14]A[&nbsp; ]P[&nbsp; ]*[15]L[16]I[&nbsp; ]P[&nbsp; ]S<br>
  [&nbsp; ]*[&nbsp; ]*[&nbsp; ]A[&nbsp; ]*[&nbsp; ]*[&nbsp; ]*[&nbsp; ]N[&nbsp; ]*[&nbsp; ]*<br>
  [17]T[18]H[&nbsp; ]A[19]W[&nbsp; ]*[20]S[&nbsp; ]N[21]O[22]W<br>
  [23]A[&nbsp; ]E[&nbsp; ]*[24]I[&nbsp; ]C[&nbsp; ]E[&nbsp; ]*[25]W[&nbsp; ]E<br>
  [26]R[&nbsp; ]A[27]I[&nbsp; ]N[&nbsp; ]*[28]A[29]U[&nbsp; ]N[&nbsp; ]T<br>
  [&nbsp; ]*[30]T[&nbsp; ]A[&nbsp; ]D[&nbsp; ]*[31]S[&nbsp; ]I[&nbsp; ]S[&nbsp; ]*<br>
  Across<br>
&nbsp;1.It feels like this when 3 Down is high and there is a lot of 18 Down around<br>
&nbsp;4.Gave food to<br>
&nbsp;7.Strong wind, like on the ocean<br>
&nbsp;8.Breezy and open<br>
  10.Northern Ireland (abbr.)<br>
  11.Million (abbr.)<br>
  12.Old English (abbr.)<br>
  13.Loud noise, like a bolt of thunder; or to put your hands toguether for applause<br>
  15.You speak with these<br>
  17.This happens in the spring, when frozen things turn into water<br>
  20.Frozen water that falls as flakes<br>
  23.Arts and Entertainment (abbr.)<br>
  24.Frozen water that is solid<br>
  25.Us; you and me<br>
  26.Water that has come toguether and fallen<br>
  28.She's often married to uncle<br>
  30._pole, a baby frog<br>
  31.She's related to 'bro'<br>
  Down<br>
&nbsp;1.Frozen water that falls like hard, round stones<br>
&nbsp;2._'Yeller<br>
&nbsp;3.Temperature (abbr.)<br>
&nbsp;4.During this season, it gets coulder and leaves turn color<br>
&nbsp;5.Either (abbr.)<br>
&nbsp;6.26 Across comes in a little 'package' like this<br>
&nbsp;7.General Nutrition Center (abbr.)<br>
&nbsp;9.Positive answer; opposite of no<br>
  14.American Automobile Association (abbr.)<br>
  16.Small and couzy hotel<br>
  17.Black stuff used to put a roof toguether<br>
  18.Energy that makes things warm<br>
  19.The strong movement of a lot of air<br>
  20.Most of the water on earth, and the weather, comes from these<br>
  21.Has, possesses<br>
  22.Covered with water<br>
  27.Iowa, on a letter<br>
  29.University of Illinois (abbr.)<br>
<small>_______________________________________________________________________________<br>
</small></small></font></p>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB 
  style="COLOR: black">Crossword2</SPAN></STRONG><SPAN lang=EN-GB 
  style="COLOR: black"> (continuación). Como puede observarse, el autor de un 
  crucigrama debe escribir en primer lugar el tamaño de la rejilla, 9x9 en el 
  ejemplo. A continuación la rejilla ordenada exactamente como queremos que se 
  muestre. Cada elemento de la rejilla se representa por [ ]*. Despues de la 
  rejilla el fichero debería contener la palabra <STRONG>Across </STRONG>en una 
  línea seguida de todas las definiciones horizontales cada una en una línea. 
  Finalmente la palabra <STRONG>Down</STRONG> en una línea seguida de todas las 
  definiciones verticales, cada una en una línea. Las definiciones deben ser 
  precedidas por un número que identficica su posición en la rejilla y un punto. 
  El primer objeto media de la plantilla tiene <STRONG>name="Crossword"</STRONG> 
  y debe tener como <STRONG>TEXT</STRONG> el nombre del fichero que contiene el 
  crucigrama. En el ejemplo este es <STRONG><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; COLOR: black; FONT-FAMILY: 'Courier New'">txt/TheWeather.txt</SPAN></STRONG><SPAN 
  lang=EN-GB style="COLOR: black">. El segundo objeto media tiene 
  <STRONG>name="Definitions"</STRONG> y en TEXT las palabras "Across|Down" o las 
  que el autor quiere que aparezcan antes de las definiciones de palabras 
  horizontales o verticales.</SPAN></SPAN></P>
  <P><SPAN lang=EN-GB style="COLOR: black"></SPAN><SPAN lang=EN-GB 
  style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">onAssociation. 
  Match 2</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black"> tiene un nuevo 
  valor posible para el parámetro: <STRONG>verify. </STRONG>Cuando este nuevo 
  valor se asigna al parámetro verify, la relación en lugar de ser arrastrar y 
  soltar (drag &amp; drop) cambia a una flecha (similar a una banda elástica) 
  desde el origen hasta el puntero del ratón.. Cuando el botón del ratón se 
  suelta sobre el destino, si la asociación es correcta se reproduce el sonido 
  para asociaciones correctas, y la línea permanece. Si la asociacione es 
  incorrecta la línea desaparece. Esta interacción puede ser aplicada a 
  ejercicios de volcabulario, pidiendole al estuciente que asocie palabras en un 
  idioma con su traducción en otro lenguaje, otra posibilidad es entre imagenes 
  y palabras o viceversa.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</SPAN></SPAN> 
  <SPAN lang=EN-GB style="COLOR: black">La <STRONG>traducción de lenguaje 
  </STRONG>ha sido mejorada en la interacción "memory". En la versión anterior 
  cuando el usuario intentaba cambiar el idioma en una interacción "memory" que 
  ya había iniciado el resultado era muy malo. Esto se debe al hecho de que las 
  interacciones pierden el tiempo con el contenido de los objetos media. El 
  problema ha sido solucionado en la interacción "memory", pero no es posible 
  solucionarlo en general. Sugerimos que no se proporcionen traducciones de los 
  contenidos por el autor. Todo lo que se modifique por la interacción no 
  debería ser traducido. Por lo que solo las explicaciones, las etiquetas fijas 
  de los botones, y los estímulos deberían ser traducidos.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB style="COLOR: black">En la versión anterior los 
  <STRONG>eventos de ratón </STRONG>no funcionaban bien con todas las 
  interacciones. Este problema ha sido solucionado.</SPAN><SPAN 
  lang=EN-GB></SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB style="COLOR: black">Errores en 
  Frames</SPAN></STRONG><SPAN lang=EN-GB style="COLOR: black">. Cuando un frame 
  no puede ser cargado porque contiene un error, tanto los ficheros de log del 
  DVE como los del RTS recogerán el nombre del frame causante del fallo. Los 
  frames pueden contener errores porque el fichero está estropeado o por culpa 
  de un error humano en la edición manual. Las versiones anteriones podían 
  fallar y no proporcionar el nombre del frame erróneo. Esto es especialmente 
  importante en el DVE porque intenta leer todos los frames de un proyecto 
  cuando el proyecto está abierto, y es suficiente que un solo un frame contenga 
  un error para que el programa falle. Si esto ocurre ahora se ofrece la 
  posibilidad de consultar el fichero dve.log para localizar el frame 
  erróneo.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 2 Nuevas Funcionalidades</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>RTSFullScreen</SPAN></STRONG><SPAN 
  lang=EN-GB>. Se ha hecho un cambio importante en la implementación del 
  RTSFullScreen. Éste estaba implementado como una ventana Java, mientras que el 
  resto de programas de Malted estaban implementados como frames Java. Esto 
  provocaba comportamientos no deseados, en particular en los ejercicios de Gap 
  filling. Algunas veces el cursor no aparecía. En otras ocasiones el texto 
  podía escribirse en un hueco distinto en el que estaba el cursor, etc. Esto 
  era debido a un bug en las ventanas Swing. Ahora el RTS está implementado como 
  un frame Java, y por lo tanto el comportamiento del cursor es exactamente el 
  mismo que en el RTS normal. Otro tipo de diferencias deberían haber sido 
  eliminadas con este cambio.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB>El <STRONG>menu oculto</STRONG> en el<STRONG> 
  RTS</STRONG> no actualizaba su tamaño después de cambiod en el tamaño de la 
  ventana del RTS. Este problema ya está solucionado.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB>El logo de Malted, un gif animado denominado 
  <STRONG>GLOBESPIN.gif</STRONG>, estaba dando problemas en el RTS. Descubrimos 
  que tenía errores y ha sido editado para corregirlos. Ahora es 
  correcto.</SPAN></P>
  <P style="TEXT-ALIGN: center" align=center><SPAN lang=EN-GB 
  style="FONT-SIZE: 13.5pt; COLOR: blue; FONT-FAMILY: 'Calisto MT'">Malted 2 - 
  beta 1 Nuevas Funcionalidades</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Tooltips</SPAN></STRONG><SPAN 
  lang=EN-GB>: Los objetos media pueden tener tooltips, es decir, texto que 
  aparece cuando el cursor permanece estático un par de segundos sobre el 
  objeto.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>HTML</SPAN></STRONG><SPAN lang=EN-GB>: 
  Los objetos media pueden tener un simple fichero html como atributo TEXT. Este 
  texto es un ejemplo. También se puede usar texto html tanto el etiquetas como 
  en tooltips.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Eventos de ratón</SPAN></STRONG><SPAN 
  lang=EN-GB>: El programa detecta varios eventos de ratón y puede responder a 
  ellos ejecutando cualquier ACCIÓN. Los nuevos eventos son: onClick, 
  onRightClick, onMouseOver, onMouseOut, onMouseDown, onMouseUp.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Traducciones</SPAN></STRONG><SPAN 
  lang=EN-GB>: Un nuevo sistema de traducciones ha sido desarrollado. El usuario 
  puede cambiar el idoma y inmediatamente todos los assets se traducen al nuevo 
  idiomoa. Esto funciona añadiendo un sufijo a los nombres de ficheros 
  (excluyendo la extensión).</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Navegación</SPAN></STRONG><SPAN 
  lang=EN-GB>: Se permite <STRONG>goTo</STRONG> cursos y <STRONG>popOut</STRONG> 
  cursos y frames en </SPAN><SPAN lang=EN-GB 
  style="COLOR: blue; FONT-FAMILY: 'Courier New'">Malted Home</SPAN><SPAN 
  lang=EN-GB> y en cualquier URL tanto local como remoto.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Runtime</SPAN></STRONG><SPAN 
  lang=EN-GB> <STRONG>Functions</STRONG>: Las funciones de botones pueden ser 
  usadas en los ACTIONS de los objetos media.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Configuración del 
  RTS</SPAN></STRONG><SPAN lang=EN-GB>: Varias funcionalidades en tiempo de 
  ejecución pueden ser configuradas para cada proyecto (mediante la creación y 
  edición de un fichero llamado project.cfg en el directorio de cada proyecto). 
  Por ejempo: se puede definir el tamaño de la ventana, que idiomas se pueden 
  usar por la funcionalidad de traducción, el tipo y contenidos de la barra de 
  menús, etc.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Applet Malted</SPAN></STRONG><SPAN 
  lang=EN-GB>: El applet de Malted ha sido mejorado, ahora funciona tanto con 
  Internet Explorer como con Netscape Navigator.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><STRONG><SPAN lang=EN-GB>Llamadas 
  JavaScript</SPAN></STRONG><SPAN lang=EN-GB>. Cualquier botón puede hacer una 
  llamada a un método de JavaScript desde el<STRONG> Applet de 
  Malted</STRONG>.</SPAN></P>
  <P><SPAN lang=EN-GB>El siguiente texto en gris claro ya no es necesario a 
  partir de la versión v.2 beta 6:</SPAN></P>
  <P><SPAN lang=EN-GB style="COLOR: #808080">Para que el <STRONG>Applet de 
  Malted</STRONG> sea completamente funcionald se deben proporcionar una serie 
  de permisos mediante la inclusión de:</SPAN></P><PRE><SPAN lang=EN-GB style="COLOR: #808080">grant codeBase "file:/C:/Malted2/classes/MaltedApplet.jar" {</SPAN></PRE><PRE><font color="#808080"><SPAN>&nbsp; </SPAN>permission java.awt.AWTPermission "showWindowWithoutWarningBanner";</font></PRE><PRE><font color="#808080"><SPAN>&nbsp; </SPAN>permission java.awt.AWTPermission "accessClipboard";</font></PRE><PRE><font color="#808080"><SPAN>&nbsp; </SPAN>permission java.io.FilePermission "&lt;&lt;ALL FILES&gt;&gt;", "execute";</font></PRE><PRE><font color="#808080"><SPAN>&nbsp; </SPAN>permission java.lang.RuntimePermission "queuePrintJob";</font></PRE><PRE><SPAN lang=EN-GB style="COLOR: #808080">};</SPAN></PRE>
  <P><SPAN lang=EN-GB style="COLOR: #808080">en el fichero </SPAN><B>
  <SPAN 
  lang=EN-GB 
  style="COLOR: #808080; FONT-FAMILY: 'Courier New'">C:\WINDOWS\.java.policy</SPAN></B><SPAN 
  lang=EN-GB style="COLOR: #808080; FONT-FAMILY: 'Courier New'"> </SPAN>
  <SPAN 
  lang=EN-GB style="COLOR: #808080">Si no este fichero no existe hay que crearlo 
  como un fichero de texto e incluir estas líneas.</SPAN></P>
  <P><SPAN lang=EN-GB>Si ha finalizado con la lectura de las instrucciones de 
  instalación puede continuar probando varios applets de Malted: </SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB>Templates.</SPAN></P>
  <P><SPAN lang=EN-GB style="FONT-SIZE: 10pt; FONT-FAMILY: Symbol">·<SPAN 
  style="FONT: 7pt 'Times New Roman'">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
  </SPAN></SPAN><SPAN lang=EN-GB>Malted2Examples.</SPAN></P>
  <P><SPAN lang=EN-GB>Aquí hay links a otros ficheros LEEME que contienen 
  información importante:</SPAN></P>
  <P><a target="_blank" href="Readme_v.1.4.txt">Readme_v.1.4.txt</a><br>
    <a target="_blank" href="Readme_v.1.3.txt">Readme_v.1.3.txt</a><br>
    <a target="_blank" href="Readme_v.1.2.txt">Readme_v.1.2.txt</a><br>
    <a target="_blank" href="Readme_v.1.1.txt">Readme_v.1.1.txt</a></P>
</BLOCKQUOTE></BODY></HTML>