<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Men&uacute; del Editor Malted (DVE) - Modo Editor de Frames</title>
</head>
<body bgcolor="#FFFFFF" background="imagenes/logo1.gif" lang=ES>
<table width="600" border="0" align="center" cellpadding="3" cellspacing="0">
  <tr> 
    <td width="588"> <div align="center"> 
        <p><strong><u><font size="3" face="Arial, Helvetica, sans-serif"><font color="#003366"><font color="#000066">Menu 
          de l&#8217;Editeur Malted (DVE) &#8211; Mode Editeur de Frames</font></font></font></u></strong></p>
      </div></td>
  </tr>
  <tr> 
    <td> <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><u><font color="#CC0000">Menu 
        &quot;Fichier&quot;:</font><br>
        <br>
        </u><strong>Nouveau frame: </strong> Ouvre la fen&ecirc;tre de dialogue 
        &quot;Nouveau frame&quot;. L&#8217;utilisateur peut s&eacute;lectionner 
        un mod&egrave;le (mod&egrave;le de frame) du menu qui se d&eacute;plie 
        et peut aussi le pr&eacute;visualiser avant de l&#8217;ajouter au projet 
        .<br>
        Le mod&egrave;le &quot; _Blank&quot; qui n&#8217;a aucune interaction 
        li&eacute;e, est s&eacute;lectionn&eacute; par d&eacute;faut. Le Nom du 
        Frame peut &ecirc;tre chang&eacute; ou bien on peut conserver celui qui 
        appara&icirc;t par d&eacute;faut.<br>
        On peut avoir plusieurs frames ouverts en m&ecirc;me temps.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ouvrir...:</strong> 
        Sert &agrave; ouvrir un frame qui existe d&eacute;j&agrave; dans le Projet. 
        Il ouvre un fen&ecirc;tre de dialogue avec une liste des frames qui contiennent 
        le Projet, parmi lequels on peut choisir un. <br>
        Il peut y avoir plusieurs Frames ouverts en m&ecirc;me temps.</font></p>
      <p align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Fermer:</strong> 
        Ferme le frame actif. S&#8217;il n&#8217;a pas &eacute;t&eacute; sauv&eacute;, 
        le syst&egrave;me demande si on veut le sauver.<strong><br>
        <br>
        Sauver: </strong>Sauve le frame dans le disque dur avec le Nom qu&#8217;on 
        lui avait assign&eacute; au d&eacute;but lorsqu&#8217;on la cr&eacute;&eacute;.<strong><br>
        <br>
        Sauver sous... :</strong> Permet de sauver le Frame avec un Nom nouveau, 
        en gardant une copie du Frame avec le Nom original.<strong><br>
        <br>
        Importer frame:</strong> Ouvre une fen&ecirc;tre de dialogue pour importer 
        des Frames d&#8217;autres projets vers celui sur lequel on est en train 
        de travailler<strong> <br>
        <br>
        <img src="imagenes/importar_frame.gif" width="484" height="218"> <br>
        <br>
        </strong>L&#8217;Importation Remota n&#8217;est pas encore d&eacute;velopp&eacute;e. 
        Il faut appuyer sur le bouton &quot;<strong>Chercher dans les disques 
        locaux&quot;</strong>, localiser le projet avec le frame souhait&eacute; 
        et s&eacute;lectionner le Frame dans le dossier xml du dossier pour l&#8217;ouvrir 
        ensuite. On peut r&eacute;p&eacute;ter la m&ecirc;me d&eacute;marche pour 
        importer plus de Frames &agrave; la liste. Lorsqu&#8217;on aura finit, 
        il faut appuyer sur le bouton &quot;<strong>Ajouter la liste au projet</strong>&quot; 
        pour que l&#8217;importation se fasse.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Nouveau 
        projet: </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Ouvre 
        la fen&ecirc;tre de dialogue &quot;Nouveau Projet&quot; dans laquelle 
        l&#8217;utilisateur doit introduire le Nom du nouveau projet. Cette option 
        est d&eacute;sactiv&eacute;e s&#8217;il y a d&eacute;j&agrave; un projet 
        ouvert dans l&#8217;Editeur Malted. Pour pouvoir cr&eacute;er un Projet, 
        il faut tout d&#8217;abord fermer le Projet sur lequel on est en train 
        de travailler. La fen&ecirc;tre de dialogue permet aussi de choisir l&#8217;emplacement 
        dans le disque dur.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ouvrir 
        projet</strong>: Ouvre une fen&ecirc;tre de dialogue dans laquelle il 
        y a une liste avec les projets existants dans le disque dur, parmi lesquels 
        l&#8217;utilisateur peut en choisir un. Pour ouvrir un projet, il faut 
        le s&eacute;lectionner et ensuite appuyer sur le bouton Ouvrir.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Fermer 
        Projet</strong>: Ferme le projet qui est ouvert. Il demande si on veut 
        sauver les cours ou les frames du projet qui n&#8217;ont pas &eacute;t&eacute; 
        sauv&eacute;s.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Sortir 
        </strong>: Ferme l&#8217;application. Il demande si on veut sauver les 
        cours ou les frames qui n&#8217;ont pas &eacute;t&eacute; sauv&eacute;s.</font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Menu 
        &quot;Edition&quot;<br>
        <br>
        </u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>D&eacute;faire</strong>: 
        D&eacute;fait le dernier changement r&eacute;alis&eacute; dans le Frame 
        dans lequel on est en train de travailler.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Couper</strong> 
        / <strong>Coller</strong> / <strong>Copier</strong> / <strong>Effacer</strong>: 
        Ces actions basiques de l&#8217;&eacute;dition applicables &agrave; tous 
        les Objets du Frame (Objet M&eacute;dia, Panneaux, Cartes, Conteneurs).</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Editeur 
        Script</strong>: Ouvre le code xml du Frame dans l&#8217;&eacute;diteur 
        de texte pour pouvoir le modifier. Pour activer cette option, il faut 
        tout d&#8217;abord Sauver les derniers changements r&eacute;alis&eacute;s 
        dans le cours. <br>
        Apr&egrave;s avoir fait les changements dans le code, sauver le fichier 
        dans l&#8217;&eacute;diteur de texte, et de retour &agrave; la fen&ecirc;tre 
        de l&#8217;Editeur Malted, on doit s&eacute;lectionner le menu<font color="#CC0000"> 
        Edition &gt; Actualiser frame</font> pour que les changements soient saisis 
        dans le Frame.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Actualiser 
        Frame</strong>: Actualise le frame lorsqu&#8217;on a r&eacute;alis&eacute; 
        les changements dans le code.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Pr&eacute;f&eacute;rences</strong>: 
        Ouvre la fen&ecirc;tre &quot;Malted Options&quot; qui permet de changer 
        la langue de l&#8217;application. Permet aussi d&#8217;&eacute;tablir 
        si on veut, que lorsqu&#8217;on d&eacute;marre l&#8217;Editeur Malted, 
        celui-ci s&#8217;ouvre en Mode Editeur de Frames ou de Cours. Il permet 
        de m&ecirc;me d&#8217;ajouter des applications externes au menu Outils, 
        et configurer l&#8217;acc&egrave;s &agrave; une Base de Donn&eacute;es.<br>
        <br>
        <img src="imagenes/pref_gener.gif" width="338" height="240"> <br>
        <br>
        </font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Menu 
        &quot;Frame&quot;<br>
        <br>
        </u> </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Les 
        actions de ce menu sont seulement disponibles au cas o&ugrave; il y a 
        un frame activ&eacute;.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Propri&eacute;t&eacute;s</strong>: 
        Ouvre la fen&ecirc;tre de propri&eacute;t&eacute;s du frame, o&ugrave; 
        l&#8217;on assigne l&#8217;Interaction et d&#8217;autres caract&eacute;ristiques 
        g&eacute;n&eacute;rales du frame. Pour plus de renseignements <a href="frame_propiedades.htm">appuyer 
        ici</a>.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Description</strong>: 
        Ouvre le panneau de propri&eacute;t&eacute;s des frames dans lequel se 
        trouve le Nom du frame et une description de celui-ci qui peut &ecirc;tre 
        modifi&eacute;e.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ex&eacute;cuter 
        frame</strong>: Ouvre le Frame en mode Pr&eacute;visualisation avec toutes 
        les Actions fonctionnelles sauf celles qui font allusion &agrave; d&#8217;autres 
        frames du Cours.<br>
        <br>
        </font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Menu 
        &quot;Media&quot;<br>
        <a name="importar"></a> <br>
        </u> </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Importer 
        M&eacute;dia</strong>: Permet de localiser les fichiers M&eacute;dia qui 
        sont hors notre Projet pour les incorporer.<br>
        Il ouvre une fen&ecirc;tre d&#8217;insertion deppuis laquelle on peut 
        s&eacute;lectionner un fichier m&eacute;dia du disque dur ou charger un 
        fichier m&eacute;dia dans une base de donn&eacute;es externe.<br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <img src="imagenes/importar_media0.gif" width="438" height="249"><br>
        <br>
        On appuie sur <strong>Chercher dans les disques locaux</strong> et on 
        localise les fichiers &agrave; importer.</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <br>
        <img src="imagenes/importar_media1.gif" width="381" height="245"><br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        En faisant double clic sur un fichier, il s&#8217;ajoute &agrave; la liste 
        d&#8217;importation. On peut r&eacute;p&eacute;ter le m&ecirc;me processus 
        avec plus de fichiers. <br>
        <br>
        <img src="imagenes/importar_media2.gif" width="438" height="249"><br>
        <br>
        Lorsqu&#8217;on aura finit d&#8217;ajouter des fichiers &agrave; la liste, 
        on appuie sur<strong> Ajouter &agrave; la liste du projet</strong>. Les 
        fichiers de la liste seront copi&eacute;s dans les dossiers correspondants 
        (image, audio, etc&#8230;) du projet.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Edition</strong>: 
        D&eacute;marre un &eacute;diteur externe pour &eacute;diter le fichier 
        m&eacute;dia s&eacute;lectionn&eacute;. On choisit l&#8217;application 
        en fonction du type de format qu&#8217;a le fichier m&eacute;dia, comme 
        d&eacute;finit dans le paragraphe &quot;Options&quot;.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <strong>Pr&eacute;visualisation</strong>: Fournit une vue pr&eacute;liminaire 
        du fichier s&eacute;lectionn&eacute;.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Renommer</strong>: 
        Ouvre une fen&ecirc;tre de dialogue avec un espace de texte remplit avec 
        le nom qui correspond &agrave; celui du fichier du m&eacute;dia actuel. 
        On peut &eacute;crire un nom nouveau dans l&#8217;espace de texte et le 
        confirmer en faisant double clic sur l&#8217;option &quot;Accepter&quot;.<font color="#CC0000"><u><br>
        <br>
        </u></font></font><font color="#CC0000"><u><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Menu 
        &quot;Outils&quot;</u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        </font></u><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        Ouvre un liste aves les &eacute;diteurs disponibles (application externes) 
        qui ont &eacute;t&eacute; d&eacute;finis pr&eacute;alablement dans le 
        menu <font color="#CC0000">Edition &gt; Pr&eacute;f&eacute;rences</font>. 
        Chaque paragraphe de ce menu ouvre l&#8217;application qui lui correspond.</font></font></p>
      <p><font color="#CC0000"><font size="2" face="Arial, Helvetica, sans-serif"><u> 
        <br>
        Menu &quot;Mode&quot;</u></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Cours</strong>: 
        Active le Mode Editeur de Cours.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Frame</strong>: 
        Active le mode Editeur de Frames.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Dans 
        la deuxi&egrave;me moiti&eacute; du menu Mode appara&icirc;t une liste 
        avec les Frames ouverts. Le frame actif appara&icirc;t avec un point. 
        C&#8217;est &agrave; partir de l&agrave;, que l&#8217;on peut changer 
        le frame actif pour &eacute;diter un autre frame qui soit ouvert.</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        </font><br>
        <font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Menu 
        &quot;Aide&quot;<br>
        <br>
        </u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Aide 
        Malted</strong>: Ouvre une fen&ecirc;tre avec le tutoriel de l&#8217;Editeur 
        Malted (DVE).</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>A 
        propos de&#8230;</strong> : Ouvre une fen&ecirc;tre avec des renseignements 
        sur le projet Malted.</font></p>
      </td>
  </tr>
  <tr> 
    <td ><div align="right"><font size="2" face="Arial, Helvetica, sans-serif"><br>
        <a href="Menu_Curso.htm">&gt;&gt; Menu de l&#8217;Editeur Malted (DVE) 
        &#8211; Mode Editeur de Cours</a></font></div></td>
  </tr>
</table>
</body>
</html>
