<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Conceptos b&aacute;sicos del Editor Malted</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="imagenes/logo1.gif">
<table width="608" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr>
    <td width="608"><p align="center"><font size="3" face="Arial, Helvetica, sans-serif"><strong><u>
	<br>
	Conceptos 
        b&aacute;sicos del Editor Malted (DVE):</u></strong></font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif">- Para poder com</font><font size="2" face="Arial, Helvetica, sans-serif">enzar 
        a trabajar con el Editor Malted es <strong>necesario abrir o crear un 
        nuevo proyecto</strong> nada m&aacute;s lanzar la aplicaci&oacute;n. </font><font face="Arial, Helvetica, sans-serif"> 
        </font></p>
      <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        Al crear un proyecto nuevo, <strong>autom&aacute;ticamente se generan 
        en la carpeta projects de Malted una carpeta con el nombre del proyecto 
        y dentro de &eacute;sta 5 carpetas: audio, image, text, video, xml.</strong> 
        En las cuatro primeras se ir&aacute;n almacenando todos los ficheros externos 
        que vayamos incorporando al proyecto, seg&uacute;n su naturaleza, y en la 
        &uacute;ltima se guardar&aacute;n los frames (xml) que generemos y el 
        course (cxml) que reunirá a un conjunto de ellos. </font></p>
      <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        El Editor Malted tiene <strong>dos modos de trabajo: El Editor de Cursos</strong>, 
        donde se determina el orden lineal o complejo de los frames y los enlaces entre ellos, 
        y el <strong>Editor de Frames</strong>, que permite maquetar pantallas 
        con ejercicios e importar ficheros externos como im&aacute;genes, sonidos, 
        video y texto. Podemos cambiar de un modo a otro r&aacute;pidamente mediante 
        el botón de Frame/Curso con dos flechas en el men&uacute; de iconos superior.</font></p>
      <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        Estando en el <strong>modo Editor de Cursos</strong>, a la izquierda aparece 
        una ventana vertical con todos los frames que componen el proyecto. Si 
        seleccionamos uno de ellos con el bot&oacute;n derecho, podremos editarlo, pasando 
        autom&aacute;ticamente al modo Editor de Frames, y si hacemos doble-clic 
        sobre el nombre del frame, se abrir&aacute; una vista previa de dicho frame 
        completamente funcional, salvo en sus enlaces con los dem&aacute;s frames. 
        En el modo Editor de Cursos la ventana principal de la derecha contiene 
        los frames que componen el curso. Para incorporar frames del proyecto 
        al curso basta con arrastrarlos de la ventana izquierda a la ventana de 
        la derecha. Podemos generar m&aacute;s de un curso cambiando el orden 
        lineal en que se presentar&aacute;n los ejercicios y los enlaces entre 
        los distintos frames.</font></p>
      <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        En el <strong>modo Editor de Cursos</strong>,  
        si seleccionamos la opci&oacute;n <strong>Ejecutar curso </strong>bajo 
		el menú Curso,&nbsp; se 
        abrir&aacute; el curso con el RTE, permitiendo navegar por todos los ejercicios 
        as&iacute; como saltar de un frame a otro y editar el c&oacute;digo xml 
        y cxml.</font></p>
      <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        Estando en el <strong>modo Editor de Frames</strong>, a la izquierda nos 
        aparece una ventana con las carpetas de audio, im&aacute;genes, texto 
        y v&iacute;deo contenidos en el proyecto. A la derecha está la ventana 
        principal de maquetaci&oacute;n de ejercicios.</font></p> <p align="justify"><font size="2" face="Arial, Helvetica, sans-serif">- 
        En el <strong>modo Editor de Frames</strong> bajo el men&uacute; Frame, 
        si seleccionamos <strong>Ejecutar Frame</strong> , se abrir&aacute; un 
        vista previa del frame totalmente funcional, salvo en sus enlaces a otros frames del curso.<br>
        </font></p>
      <p><font face="Arial, Helvetica, sans-serif"> </font> </p></td>
  </tr>
</table>
</body>
</html>
