<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>5. El Contenedor</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="imagenes/logo1.gif">
<table width="620" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td colspan="2"><div align="center"> 
        <p><strong><u><font size="3" face="Arial, Helvetica, sans-serif"><font color="#003366"><font color="#000066">5. 
          El Contenedor :</font></font></font></u></strong></p>
      </div></td>
  </tr>
  <tr> 
    <td colspan="2"> <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr> 
          <td><img src="imagenes/containers_vacio.gif" width="130" height="52"></td>
          <td>&nbsp;<font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong><font color="#003366">El 
            Contenedor:</font><font color="#00CCFF"><font color="#000066"> </font></font></strong>representado 
            por un marco azul: delimita una <u>capa</u> con <u>dimensiones y coordenadas 
            configurables</u> y tiene las siguientes<strong> funciones</strong>:</font></td>
        </tr>
      </table>
      <div align="center"></div></td>
  </tr>
  <tr> 
    <td width="490"> <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">A) 
        Se emplea para conferir coordenadas de posici&oacute;n tanto a <strong>Objetos 
        Media</strong> como <strong>Paneles</strong> y as&iacute; tener m&aacute;s 
        control sobre su posicionamiento. Basta con introducir el Media o el Panel 
        dentro de un contenedor y luego editar el contenedor para modificar las 
        coordenadas de posicionamiento en pantalla.</font></p></td>
    <td width="130"><div align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><img src="imagenes/container_1media.gif" width="130" height="72"></font></div></td>
  </tr>
  <tr> 
    <td width="490"> <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">B) 
        Permite <u>uniformar las dimensiones de todos los medias dentro del contenedor.</u></font></p></td>
    <td><div align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><img src="imagenes/container_4medias.gif" width="130" height="103"></font></div></td>
  </tr>
  <tr> 
    <td colspan="2"> <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> 
      <br>
      C) Se le puede asignar un <u>nombre</u>, lo cual es <u>necesario a la hora 
      de emplear las <strong>Interacciones</strong></u> programadas en Malted.</font> 
      <br> </td>
  </tr>
  <tr> 
    <td colspan="2"><p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong><font color="#003366"><br>
        1. Creaci&oacute;n:</font><font color="#00CCFF"><font color="#000066"> 
        </font></font></strong>Para A&ntilde;adir un Contenedor, estando en el 
        Modo de edici&oacute;n de Frames:<br>
        - Bot&oacute;n derecho del rat&oacute;n sobre la zona de trabajo &gt; 
        <font color="#CC0000">Insertar un contenedor</font></font></p>
      <p><font color="#003366" size="2" face="Arial, Helvetica, sans-serif"><strong>&nbsp;2. 
        Edici&oacute;n: </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Hacemos 
        doble click sobre el Contenedor o lo seleccionamos con el <font color="#CC0000">bot&oacute;n 
        derecho</font> (al seleccionar el contenedor, su marco pasa de azul a 
        amarillo) y pulsamos sobre la opci&oacute;n <font color="#CC0000">Edici&oacute;n</font> 
        del men&uacute;. Se abrir&aacute; la ventana de Edici&oacute;n del Contenedor. 
        En la casilla superior podemos asignar un Nombre. Debajo hay 2 pesta&ntilde;as 
        que permiten configurar las propiedades del Contenedor:<br>
        <br>
        <img src="imagenes/contendor_dimensiones.gif" width="443" height="260"> 
        <br>
        <br>
        <u><strong>Pesta&ntilde;a Dimensiones:</strong></u><br>
        <br>
        <strong>- L&iacute;mites del Contenedor:</strong> Las coordenadas de Izquierda 
        y Arriba son coordenadas de la esquina superior izquierda del Contenedor. 
        Alto y Ancho definen las dimensiones del contenedor. Estos n&uacute;meros 
        se pueden introducir aqu&iacute; o tambien se pueden ajustar gr&aacute;ficamente 
        seleccionando el contenedor, colocando el puntero sobre los bordes y arrastarndo 
        los punteros de posici&oacute;n y redimensionamiento.</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        </font></p></td>
  </tr>
  <tr> 
    <td> <div align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> 
        </font> <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> 
        <strong><br>
        - Tama&ntilde;o de los objetos interiores:</strong> Para que esta opci&oacute;n 
        sea editable debe estar marcada la casilla &quot;Uniform&quot;. Permite 
        especificar un Alto y Ancho que se aplicar&aacute; a todos los Objetos 
        Media incluidos en el interior del Contenedor haci&eacute;ndolos de tama&ntilde;o 
        uniformes. </font></div></td>
    <td><img src="imagenes/container_5media.gif" width="76" height="83"></td>
  </tr>
  <tr> 
    <td colspan="2"><font color="#003366" size="2" face="Arial, Helvetica, sans-serif">&nbsp;</font> 
      <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
      Si no se especifica Ancho y Alto la uniformizaci&oacute;n se hace por igual 
      tanto en el Ancho como en el Alto hasta llenar el interior del Contenedor 
      generando cajas de 2x2, 3x3, etc:<br>
      El bot&oacute;n Llenar ajusta las dimensiones de los Objetos Media, llegando 
      hasta el l&iacute;mite interior del Contenedor.</font><br> <br> <img src="imagenes/container_uniform.gif" width="247" height="82"> 
      <br> </td>
  </tr>
  <tr> 
    <td colspan="2"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>- 
      Otras propiedades:<br>
      Transparente:</strong> Hace que el fondo del contenedor sea transaparente. 
      Esta propiedad la heredan todos los Objetos Media contenidos en principio 
      aunque es posible editar posteriormente cada Media por separado para controlar 
      su transparencia.<br>
      <strong>Despliegue Aleatorio:</strong> Hace que los Objetos Media dentro 
      del Contenedor se muestren en orden aleatorio. Esta aleatoriedad no se muestra 
      en la zona de trabajo dentro del Editor Malted , pero s&iacute; al Ejecutar 
      el frame en cuesti&oacute;n. (Para poder Ejecutarlo es necesario Guardarlo 
      antes) .<br>
      <strong>Despliegue Checkbox: </strong>A&ntilde;ade a la izquierda de cada 
      Objeto Media dentro del Contenedor una Casilla de varificaci&oacute;n. Todos 
      los Medias contenidos heredan esta propiedad. Posteriormente podemos editar 
      cada Media por separado para desactivar &eacute;sta opci&oacute;n si lo 
      deseamos. <br>
      </font></td>
  </tr>
  <tr> 
    <td colspan="2"><p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><u><strong> 
        Pesta&ntilde;a Etiquetas:</strong></u><br>
        Permite controlar el aspecto de la Fuente, su formato y el color de fondo 
        dentro de tdos los Objetos Media incluidos en el Contenedor. Estas propiedades 
        pueden modificarse luego por separado en cada Objeto Media si no se desea 
        una uniformidad total de estilos en todos los Media.<br>
        </font><br>
        <img src="imagenes/container_etiquetas.gif" width="370" height="207"><br>
      </p></td>
  </tr>
  <tr> 
    <td colspan="2"> <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><u><strong><br>
        Superposici&oacute;n de Contenedores:</strong></u><br>
        Cuando tenemos varios Contenedores superpuestos o con zonas solapadas, 
        si queremos modificar el orden de las capas debemos editar el c&oacute;digo 
        xml del frame. Para esto es necesario primero Guardar el Frame y luego 
        pulsar el icono XML &oacute; seleccionar el men&uacute; <font color="#CC0000">Edici&oacute;n 
        &gt; Editar script <font color="#000066">. El c&oacute;digo xml se abre 
        por defecto con el WordPad en Windows. Los Contenedores en el c&oacute;digo 
        aparecen definidos con etiquetas <strong><br>
        <br>
        &lt;BOUNDS&gt;&lt;/BOUNDS&gt;</strong> por ejemplo:<br>
        <br>
        <strong>&lt;BOUNDS NAME=&quot;new&quot; UNIFORM=&quot;true&quot; LEFT=&quot;413&quot; 
        TOP=&quot;365&quot; WIDTH=&quot;100&quot; HEIGHT=&quot;100&quot; RANDOM=&quot;false&quot;&gt;<br>
        &lt;/BOUNDS&gt;</strong><br>
        <br>
        Los Contenedores se ordenan en capas seg&uacute;n su posicionamiento en 
        el c&oacute;digo. Aquellos que aparezcan antes en el c&oacute;digo est&aacute;n 
        en capas superiores que los que aparezcan m&aacute;s abajo en el c&oacute;digo. 
        Por tanto cambiar la capa en la que se encuentra un Contenedor es tan 
        sencillo como cambiar su situaci&oacute;n en el c&oacute;digo mediante 
        corta y pega.<br>
        <br>
        Una vez modificado el c&oacute;digo, <strong>Guardar</strong> el documento 
        xml en el WordPad y volver a la ventana de Malted. Seleccionar el men&uacute; 
        <font color="#CC0000">Edici&oacute;n &gt; Actualizar frame <font color="#000066">y 
        se aplicar&aacute;n los cambios realizados en el c&oacute;digo.<br>
        <br>
        </font></font></font></font></font></p></td>
  </tr>
  <tr> 
    <td><p align="left"><font size="2" face="Arial, Helvetica, sans-serif"><a href="objeto_media.htm">&lt;&lt;</a></font></p></td>
    <td><div align="right"><font size="2" face="Arial, Helvetica, sans-serif"><a href="panel.htm">&gt;&gt; 
        6. El Panel</a></font></div></td>
  </tr>
</table>
</body>
</html>
