<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>2. El Editor Malted (DVE). Mi primer proyecto</title>
</head>
<body bgcolor="#FFFFFF" background="imagenes/logo1.gif" class="Normal" lang=ES>
<table width="600" border="0" align="center" cellpadding="3" cellspacing="0">
  <tr> 
    <td colspan="2"> <div align="center"> 
        <p><strong><u><font color="#000066" size="3" face="Arial, Helvetica, sans-serif">2</font><font size="3" face="Arial, Helvetica, sans-serif"><font color="#003366"><font color="#000066">. 
          El Editor Malted (DVE). Mi primer Proyecto</font></font></font></u></strong></p>
      </div></td>
  </tr>
  <tr> 
    <td colspan="2"> 
      <p><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif"><u> 
        El Editor Malted (DVE) tiene 2 modos diferenciados de trabajo:</u><br>
        <br>
        A) <strong>Modo Editor de Frames</strong>: Es el modo que se emplea para 
        crear y editar Frames. Tiene su propio <a href="Menu_Frame.htm">men&uacute;</a> 
        y a la izquierda muestra las carpetas de imagen, audio, video y texto 
        del Frame en el que nos encontramos trabajando. Haciendo doble click sobre 
        &eacute;stas carpetas se despliega el contenido de cada una de ellas, 
        permitiendo previsualizar los archivos y cambiarlos de nombre.<br>
        <br>
        B) <strong>Modo Editor de Cursos:</strong> Lo emplearemos para generar 
        el Curso una vez que tengamos creados los Frames que lo van a componer. 
        Tambi&eacute;n tiene su <a href="Menu_Curso.htm">men&uacute;</a> propio 
        y a la izquierda muestra la lista de todos los Frames incluidos en el 
        Proyecto en el que trabajamos. Haciendo doble-click sobre un Frame de 
        la lista, se ejecuta el frame en modo previsualizaci&oacute;n, y si seleccionamos 
        un frame de la lista y a continuaci&oacute;n apretamos el bot&oacute;n 
        derecho del rat&oacute;n aparece la opci&oacute;n de Editar el frame (pasando 
        autom&aacute;ticamente al Modo Editor de Frames).</font></font></p>
      <p><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">Para 
        pasar de un Modo a otro pulsar el icono <img src="imagenes/modo.gif" width="34" height="34" align="bottom"> 
        o seleccionar el men&uacute; <font color="#CC0000">Modo &gt; Curso</font> 
        o bien <font color="#CC0000">Modo &gt; Frame .<br>
        <font color="#000066">En la barra superior de la ventana aparece el Modo 
        en el que nos encontramos en cada momento.</font></font></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">1. 
        Cuando abrimos el Editor Malted (DVE), para poder empezar a trabajar, 
        es necesario <strong>crear un Proyecto Nuevo</strong> &oacute; <strong>abrir 
        un Proyecto</strong> ya existente. Esto se hace en el men&uacute; <font color="#CC0000">Archivo 
        &gt; Nuevo proyecto</font> o bien <font color="#CC0000">Archivo &gt; Abrir 
        proyecto</font></font><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">.<br>
        <br>
        </font><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif"><img src="imagenes/DVE_1.gif" width="559" height="206"></font></font><font color="#000066" face="Arial, Helvetica, sans-serif"> 
        <br>
        <br>
        </font></font><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">2. 
        Seleccionamos en el men&uacute; <font color="#CC0000">Archivo &gt; Nuevo 
        proyecto</font></font></font> <font color="#000066" size="2" face="Arial, Helvetica, sans-serif">y 
        aparece una ventana donde debemos introducir el Nombre del Proyecto. Para 
        &eacute;ste ejemplo, escribiremos &quot;prueba&quot;. A la hora de asignar 
        un nombre, tener en cuenta que no puede contener espacios ni caracteres 
        extra&ntilde;os. Pulsamos <strong>Aceptar.<br>
        </strong></font></p>
      </td>
  </tr>
  <tr> 
    <td colspan="2"> 
      <div align="left"> 
        <p><br>
          <img src="imagenes/DVE_2.gif" width="300" height="150"><br>
          <br>
          <font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">3. 
          Por defecto el Editor Malted entra en el Modo Editor de Frames. El siguiente 
          paso es crear un Frame pulsando el icono de &quot;<strong>Nuevo Frame</strong>&quot; 
          o el men&uacute; <font color="#CC0000">Archivo &gt; Nuevo frame<br>
          </font></font></font><br>
          <img src="imagenes/DVE_3fr.gif" width="558" height="206"><br>
          <br>
          <font color="#000066" size="2" face="Arial, Helvetica, sans-serif">4. 
          Aparece una ventana en la cual podemos<strong> elegir la plantilla</strong> 
          en la que queremos basar el frame, una peque&ntilde;a descripci&oacute;n 
          y el Nombre del Frame editable en una casilla. La plantilla por defecto 
          es &quot;_Blank.template&quot; (plantilla vac&iacute;a). </font><br>
          <br>
          <img src="imagenes/DVE_4fr.gif" width="300" height="150"> <br>
          <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
          5. Para &eacute;ste primer ejemplo seleccionamos del desplegable la 
          plantilla &quot;MCh_1Q_anyTime.template&quot;. Existe la posibilidad 
          de <strong>Previsualizar</strong> la plantilla para ver si nos interesa 
          y de <strong>cambiar el Nombre del Frame</strong> que viene por defecto. 
          Pulsamos <strong>Aceptar</strong> para continuar.</font><br>
          <br>
          <img src="imagenes/DVE_5fr.gif" width="326" height="150"><br>
          <br>
          <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> 
          6. Se abre el frame seleccionado, con todos sus Paneles, Contenedores 
          y Objetos Media listos para ser editados. Para informaci&oacute;n acerca 
          de la edici&oacute;n de estos elementos contenidos en el Frame, pasar 
          al apartado siguiente: <a href="DVE3.htm">&quot;3. Componentes b&aacute;sicos 
          para crear un frame</a>&quot;.<br>
          Para <strong>previsualizar</strong> el frame y su funcionamiento pulsar 
          el icono &quot;<strong>Ejecutar frame</strong>&quot; o seleccionar el 
          men&uacute; <font color="#CC0000">Frame &gt; Ejecutar frame. <font color="#000066">En 
          &eacute;ste modo de Previsualizaci&oacute;n del Frame todas las acciones 
          son funcionales excepto aquellas que enlazan con otros frames del Curso. 
          Si deseamos probar la navegaci&oacute;n entre Frames del Curso debemos 
          hacerlo desde el Modo Curso como se ver&aacute; m&aacute;s adelante 
          en el punto 12.</font></font></font><br>
          <br>
          <img src="imagenes/DVE_6fr.gif" width="657" height="555"></p>
      </div></td>
  </tr>
  <tr> 
    <td colspan="2"><br> <div align="left"><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">7. 
        Ahora crearemos un nuevo frame a partir de otra plantilla para a&ntilde;adirlo 
        al proyecto. Seleccionar el men&uacute; <font color="#CC0000">Archivo 
        &gt; Nuevo frame <font color="#000066">o pulsar sobre el icono <strong>Nuevo 
        frame</strong> y en la ventana emergente seleccionar la plantilla &quot;Dialog_000.template&quot; 
        y pulsar <strong>Aceptar</strong>. Se abre el Frame &quot;Dialog_000.xml&quot;:</font></font></font></font></div></td>
  </tr>
  <tr> 
    <td colspan="2"><br> <img src="imagenes/DVE_4frDialog.gif" width="657" height="541"></td>
  </tr>
  <tr> 
    <td colspan="2"><p><font color="#003366" size="2" face="Arial, Helvetica, sans-serif"> 
        &nbsp;8. </font><font size="2"><font color="#000066" face="Arial, Helvetica, sans-serif">Seleccionamos 
        el men&uacute; <font color="#CC0000">Modo</font> y en el desplegable vemos 
        que adem&aacute;s de<font size="2"> poder cambiar</font> de Modo Frame 
        a Modo Curso, tenemos la posibilidad de cambiar de Frame que estamos editando 
        (Dialog_000.xml &oacute; MCh_1Q_anyTime.xml). Seleccionamos <font color="#CC0000">Modo 
        &gt; Curso</font> para pasar al Modo Editor de Cursos. Observamos que 
        la barra superior de la ventana nos indica que estamos en el proyecto 
        &quot;prueba&quot; - &quot;Editor de CURSOS&quot; y que a la izquierda 
        aparecen los Frames que hemos incorporado al Proyecto. El Frame &quot;InfoExpl.xml&quot; 
        se incorpor&oacute; al Proyecto a la vez que &quot;MCh_1Q_anyTime.xml&quot; 
        ya que la plantilla &quot;MCh_1Q_anyTime.template&quot; de la cual partimos 
        contiene ambos Frames.<br>
        <br>
        <img src="imagenes/DVE_4co.gif" width="486" height="152"> <br>
        <br>
        9. Pulsamos el icono <strong>Nuevo curso</strong> o seleccionamos el men&uacute; 
        <font color="#CC0000">Archivo &gt; Nuevo curso </font>. Introducimos como 
        Nombre del curso &quot;prueba&quot; al igual que el nombre del Proyecto. 
        No es necesario que tengan el mismo nombre Proyecto y Curso pero es una 
        pr&aacute;ctica com&uacute;n para simplificar el manejo del Proyecto. 
        Pulsamos Aceptar.<br>
        <br>
        <img src="imagenes/DVE_5co.gif" width="300" height="113"> <br>
        <br>
        10. Observamos que en la barra superior se nos indica que nos encontramos 
        en el Proyecto <strong>prueba</strong>, Modo <strong>Editor de CURSOS</strong>, 
        y curso <strong>prueba.cxml</strong>.<br>
        <br>
        <img src="imagenes/DVE_6co.gif" width="485" height="159"><br>
        <br>
        11. Seleccionamos con el bot&oacute;n izquierdo del rat&oacute;n el Frame 
        &quot;MCh_1Q_anyTime.xml&quot; y lo <u><strong>arrastramos a la ventana 
        de la derecha</strong>, que es donde se establece el orden que van a seguir 
        los Frames (pantallas) del Curso.</u> Posteriormente repetimos la operaci&oacute;n 
        con el Frame &quot;Dialog_000.xml&quot;. El orden de los Frames en el 
        Curso sigue una numeraci&oacute;n ascendente empezando por el 0, 1, 2, 
        ... Si ahora seleccionamos uno de los Frames en la ventana de la derecha, 
        podemos subirlo o bajarlo dentro de la secuencia lineal que siguen los 
        Frames empleando los botones &quot;<strong>Arriba</strong>&quot; y &quot;<strong>Abajo</strong>&quot;. 
        <br>
        <br>
        <img src="imagenes/DVE_co_arrastrar.gif" width="510" height="178"><br>
        <br>
        12. Para comprobar el correcto funcionamiento del Curso primero debemos 
        pulsar el icono <strong>Guardar</strong>, &oacute; seleccionar el men&uacute; 
        <font color="#CC0000">Archivo &gt; Guardar <font color="#000066">y una 
        vez guardados los cambios seleccionamos el men&uacute; </font>Curso &gt; 
        Ejecutar el curso</font>. Esto lanza el Malted RTE*, un Navegador con 
        opciones de edici&oacute;n incorporadas pensado para los desarrolladores 
        de Unidades did&aacute;cticas.<br>
        <br>
        <img src="imagenes/DVE_co_ejecutar.gif" width="495" height="173"><br>
        <br>
        13. Al Ejecutar el Curso se abre al aplicaci&oacute;n &quot;Navegador 
        Editor Malted (RTE)*&quot; y podemos comprobar el funcionamiento de todos 
        los Objetos Media, Tarjetas, etc. incorporados.</font><font color="#003366" size="2" face="Arial, Helvetica, sans-serif">&nbsp;El 
        bot&oacute;n Verify verifica las respuestas seleccionadas en la tarjeta 
        actual. Si pulsamos la flecha que lleva al siguiente Frame se deber&iacute;a 
        abrir la pantalla con el ejercicio Dialog_000.</font><font color="#000066" face="Arial, Helvetica, sans-serif"><br>
        <br>
        <img src="imagenes/DVE_9co.gif" width="476" height="376"> </font></font></p></td>
  </tr>
  <tr> 
    <td width="323"><div align="left"><font size="2" face="Arial, Helvetica, sans-serif"><a href="DVE1.htm">&lt;&lt;</a></font></div></td>
    <td width="328"><div align="right"><font size="2" face="Arial, Helvetica, sans-serif"><a href="DVE3.htm">&gt;&gt; 
        3. Componentes b&aacute;sicos para crear un frame</a></font></div></td>
  </tr>
</table>
</body>
</html>
