<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Men&uacute; del Editor Malted (DVE) - Modo Editor de Cursos</title>
</head>
<body bgcolor="#FFFFFF" background="imagenes/logo1.gif" class="Normal" lang=ES>
<table width="600" border="0" align="center" cellpadding="3" cellspacing="0">
  <tr> 
    <td width="588"> <div align="center"> 
        <p><strong><u><font size="3" face="Arial, Helvetica, sans-serif"><font color="#003366"><font color="#000066">Men&uacute; 
          del Editor Malted (DVE) - Modo Editor de Cursos</font></font></font></u></strong></p>
      </div></td>
  </tr>
  <tr> 
    <td> <p><font size="2"><font color="#CC0000" size="3" face="Arial, Helvetica, sans-serif"><strong>Modo 
        Editor de Cursos:</strong></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><u><font color="#CC0000">Men&uacute; 
        &quot;Archivo&quot;</font>:<br>
        <br>
        </u><strong>Nuevo curso: </strong>Crea un curso nuevo. Si hay alg&uacute;n 
        curso activo en la ventana curso, lo cierra preguntando previamente si 
        desea guardarlo.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Abrir...:</strong> 
        Abre un cuadro de di&aacute;logo con una lista de los cursos que contiene 
        el Proyecto, de entre los cuales se puede escoger uno. A diferencia de 
        los frames, no puede haber m&aacute;s de un curso activado a la vez.<br>
        <br>
        <strong>Cerrar:</strong> Cierra el curso activo. Si no ha sido guardado, 
        el sistema pregunta si se quiere guardar con la extensi&oacute;n correspondiente 
        (.cxml).</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Guardar: 
        </strong>Guarda el curso con la extensi&oacute;n correspondiente (.cxml) 
        en el Proyecto.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Guardar 
        como...:</strong> Guarda el curso con la extensi&oacute;n correspondiente 
        (.cxml) en el disco duro y con un nombre de archivo diferente.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Importar 
        cursos:</strong> Abre un cuadro de di&aacute;logo para importar cursos 
        de otros proyectos.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Nuevo 
        proyecto: </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Abre 
        el cuadro de di&aacute;logo de &quot;Nuevo proyecto&quot; en el que el 
        usuario debe introducir el Nombre del nuevo proyecto. &Eacute;sta opci&oacute;n 
        est&aacute; desactivada si ya hay algun Proyecto abierto en el Editor 
        Malted. Para poder crear un Proyecto nuevo es necesario cerrar de antemano 
        el Proyecto en el que se est&eacute; trabajando. El cuadro de di&aacute;logo 
        tambien permite elegir la ubicaci&oacute;n en el disco duro donde se desea 
        guardar.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Abrir 
        proyecto:</strong> Abre un cuadro de di&aacute;logo en el que hay una 
        lista con los proyectos existentes en el disco duro de entre los cuales 
        el usuario puede escoger uno. Para abrir un proyecto, seleccionarlo y 
        luego pulsar el bot&oacute;n Abrir.</font></p>
      <p align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong> 
        </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Cerrar 
        proyecto: </strong>Cierra el proyecto que est&aacute; abierto. Pregunta 
        si se desean guardar los cursos o los frames del proyecto que no han sido 
        guardados.<br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong><br>
        Renombrar: </strong>Abre un cuadro de di&aacute;logo en el que se puede 
        escribir un nombre nuevo para el curso seleccionado. Un clic sobre la 
        opci&oacute;n &quot;Aceptar&quot; abre un cuadro de di&aacute;logo pidiendo 
        la confirmaci&oacute;n de la acci&oacute;n a ejecutar. En caso de no rellenar 
        el campo de nombre de proyecto aparecer&iacute;a en la pantalla un mensaje 
        de error.<strong> <br>
        <br>
        Salir: </strong>Cierra la aplicaci&oacute;n. Pregunta si se desea guardar 
        los cursos o los frames que no han sido guardados. Guarda las opciones 
        de la aplicaci&oacute;n para usos posteriores.</font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Edici&oacute;n&quot;</u></font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><strong><font color="#000066">Deshacer</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">: 
        </font></strong><font color="#000066">Deshace el &uacute;ltimo cambio 
        realizado en el Curso en el que se est&aacute; trabajando.</font></font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><strong><font color="#000066">Borrar</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">: 
        </font></strong><font color="#000066">Borra el Frame seleccionado en la 
        ventana de la izquierda</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <br>
        </font></font><strong><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Editar 
        Script : </font></strong><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Abre 
        el c&oacute;digo cxml del Curso en el editor de texto para poder modificarlo. 
        Para que &eacute;sta opci&oacute;n se active es necesario Guardar primero 
        los &uacute;ltimos cambios realizados en el curso. Una vez hechos los 
        cambios en el c&oacute;digo, guardar el fichero en el editor de texto 
        y al volver a la ventana del Editor Malted se debe seleccionar el men&uacute;<font color="#CC0000"> 
        Edici&oacute;n &gt; Actualizar frame</font> para que se reflejen los cambios 
        en el Curso.<br>
        <br>
        <strong>Actualizar Frame: </strong>Actualiza el Curso cuando hemos realizado 
        cambios en el c&oacute;digo.<br>
        <br>
        <strong>Preferencias:</strong> Abre la ventana &quot;Malted Opciones&quot; 
        que permite cambiar el idioma de la aplicaci&oacute;n, establecer si deseamos 
        que al iniciar el Editor Malted se abra en Modo Editor de Frames o de 
        Curso, a&ntilde;adir aplicaciones externas al men&uacute; de Herramientas, 
        y configurar el acceso a una Base de Datos.<br>
        <br>
        <img src="imagenes/pref_gener.gif" width="338" height="240"> </font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Curso&quot;</u></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Descripci&oacute;n: 
        </strong>Abre una ventana con las propiedades del curso, desde donde se 
        puede modificar el nombre, la descripci&oacute;n y la estructura (lineal 
        o compleja).</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Agregar 
        un frame: </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Abre 
        un cuadro de di&aacute;logo con la lista de plantillas. El frame seleccionado 
        se agregar&aacute; al curso activo.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ejecutar 
        el curso: </strong>Abre el Navegador Editor Malted (RTE) permitiendo navegar 
        por el curso y todos sus frames<strong>.<br>
        <br>
        </strong> <strong>Create Course html: </strong>Genera un fichero html 
        del curso necesario para poder verse desde el applet Malted de la web.<br>
        <br>
        </font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Frame&quot;</u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong><br>
        <br>
        Importar frame:</strong> Abre un cuadro de di&aacute;logo para importar 
        Frames de otros Proyectos al nuestro en el que estamos trabajando.<strong> 
        <br>
        <br>
        <img src="imagenes/importar_frame.gif" width="484" height="218"> <br>
        <br>
        </strong>La Importaci&oacute;n Remota a&uacute;n no est&aacute; implementada. 
        Hay que pulsar el bot&oacute;n &quot;<strong>Buscar en discos locales</strong>&quot;, 
        localizar el Proyecto con el frame deseado y dentro de la carpeta xml 
        del Proyecto seleccionar el Frame y abrirlo. Se puede repetir la operaci&oacute;n 
        para importar m&aacute;s Frames a la lista y cuando se haya terminado 
        se debe pulsar el bot&oacute;n &quot;<strong>Agregar la lista al proyecto</strong>&quot; 
        para que se realice la importaci&oacute;n.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Descripci&oacute;n: 
        </strong>Abre el panel de propiedades de los frames en el que se encuentra 
        el Nombre del frame y una descripci&oacute;n del mismo que se puede modificar.<br>
        <br>
        <strong>Editar frame: </strong>Abre el Frame seleccionado en la ventana 
        izquierda, pasando autom&aacute;ticamente al Modo Editor de Frames.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Editar 
        link: </strong></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ejecutar 
        frame: </strong>Abre el Frame en modo de Previsualizaci&oacute;n con todas 
        las Acciones funcionales salvo aquellas que hagan referencia a otros frames 
        del Curso.</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <u><font color="#CC0000"><br>
        </font></u></font><font color="#CC0000"><font size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Modo&quot;</u></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Curso: 
        </strong>Activa el Modo Editor de Cursos.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Frame: 
        </strong>Activa el Modo Editor de Frames. <br>
        <br>
        En la segunda mitad del men&uacute; Modo aprece una lista con los Frames 
        abiertos. El frame activo aparece con un punto. Desde aqu&iacute; se puede 
        cambiar de frame activo para editar otro frame que est&eacute; abierto.</font><br>
        <font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> </font><br>
        <font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Ayuda&quot;<br>
        </u></font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u><br>
        </u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ayuda 
        Malted: </strong>Abre una ventana con el tutorial del Editor Malted (DVE). 
        <br>
        <br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong> 
        Acerca de...: </strong>Abre una ventana con informaci&oacute;n sobre el 
        proyecto Malted.</font></p></td>
  </tr>
  <tr> 
    <td >&nbsp;</td>
  </tr>
</table>
</body>
</html>
