<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Men&uacute; del Editor Malted (DVE) - Modo Editor de Frames</title>
</head>
<body bgcolor="#FFFFFF" background="imagenes/logo1.gif" lang=ES>
<table width="600" border="0" align="center" cellpadding="3" cellspacing="0">
  <tr> 
    <td width="588"> <div align="center"> 
        <p><strong><u><font size="3" face="Arial, Helvetica, sans-serif"><font color="#003366"><font color="#000066">Men&uacute; 
          del Editor Malted (DVE) - Modo Editor de Frames</font></font></font></u></strong></p>
      </div></td>
  </tr>
  <tr> 
    <td> <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><u><font color="#CC0000">Men&uacute; 
        &quot;Archivo&quot;:</font><br>
        <br>
        </u><strong>Nuevo frame: </strong> Abre el cuadro de di&aacute;logo &quot;Nuevo 
        frame&quot;. El usuario puede seleccionar una plantilla (modelo de frame) 
        del men&uacute; desplegable y tambien previsualizarla antes de a&ntilde;adirla 
        al proyecto. Por defecto est&aacute; seleccionada la plantilla &quot;_Blank&quot; 
        que no tiene asociada ninguna interacci&oacute;n. El Nombre del Frame 
        se puede cambiar o dejar el que viene por defecto. Se puede tener a la 
        vez m&aacute;s de un frame abierto.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Abrir...:</strong> 
        SIrve para abrir un frame ya existente en el Proyecto. Abre un cuadro 
        de di&aacute;logo con una lista de los frames que contiene el Proyecto, 
        de entre los cuales se puede escoger uno. Puede haber m&aacute;s de un 
        Frame abierto a la vez.</font></p>
      <p align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Cerrar:</strong> 
        Cierra el frame activo. Si no ha sido guardado, el sistema pregunta si 
        se quiere guardar.<strong><br>
        <br>
        Guardar: </strong>Guarda el Frame en el disco duro con el Nombre que se 
        le hab&iacute;a asignado previamente al crearlo.<strong><br>
        <br>
        Guardar como...:</strong> Permite guardar el Frame con un nuevo Nombre, 
        manteniendo una copia del Frame con el Nombre original.<strong><br>
        <br>
        Importar frame:</strong> Abre un cuadro de di&aacute;logo para importar 
        Frames de otros Proyectos al nuestro en el que estamos trabajando.<strong> 
        <br>
        <br>
        <img src="imagenes/importar_frame.gif" width="484" height="218"> <br>
        <br>
        </strong>La Importaci&oacute;n Remota a&uacute;n no est&aacute; implementada. 
        Hay que pulsar el bot&oacute;n &quot;<strong>Buscar en discos locales</strong>&quot;, 
        localizar el Proyecto con el frame deseado y dentro de la carpeta xml 
        del Proyecto seleccionar el Frame y abrirlo. Se puede repetir la operaci&oacute;n 
        para importar m&aacute;s Frames a la lista y cuando se haya terminado 
        se debe pulsar el bot&oacute;n &quot;<strong>Agregar la lista al proyecto</strong>&quot; 
        para que se realice la importaci&oacute;n.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Nuevo 
        proyecto: </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Abre 
        el cuadro de di&aacute;logo de &quot;Nuevo proyecto&quot; en el que el 
        usuario debe introducir el Nombre del nuevo proyecto. &Eacute;sta opci&oacute;n 
        est&aacute; desactivada si ya hay algun Proyecto abierto en el Editor 
        Malted. Para poder crear un Proyecto nuevo es necesario cerrar de antemano 
        el Proyecto en el que se est&eacute; trabajando. El cuadro de di&aacute;logo 
        tambien permite elegir la ubicaci&oacute;n en el disco duro donde se desea 
        guardar.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Abrir 
        proyecto:</strong> Abre un cuadro de di&aacute;logo en el que hay una 
        lista con los proyectos existentes en el disco duro de entre los cuales 
        el usuario puede escoger uno. Para abrir un proyecto, seleccionarlo y 
        luego pulsar el bot&oacute;n Abrir.</font></p>
      <p align="left"><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong> 
        </strong></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Cerrar 
        proyecto: </strong>Cierra el proyecto que est&aacute; abierto. Pregunta 
        si se desean guardar los cursos o los frames del proyecto que no han sido 
        guardados.<br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong><br>
        Salir: </strong>Cierra la aplicaci&oacute;n. Pregunta si se desea guardar 
        los cursos o los frames que no han sido guardados. Guarda las opciones 
        de la aplicaci&oacute;n para usos posteriores.</font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Edici&oacute;n&quot;<br>
        <br>
        </u><strong><font color="#000066">Deshacer</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">: 
        </font></strong><font color="#000066">Deshace el &uacute;ltimo cambio 
        realizado en el Frame en el que se est&aacute; trabajando.</font></font></p>
      <p><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><strong><font color="#000066">Cortar 
        / Pegar / Copiar / Borrar</font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">: 
        </font></strong><font color="#000066">Acciones b&aacute;sicas de edici&oacute;n 
        aplicables a todos los Objetos del Frame (Objeto Media, Paneles, Tarjetas, 
        Contenedores). </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        <br>
        </font></font><strong><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Editar 
        Script : </font></strong><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Abre 
        el c&oacute;digo xml del Frame en el editor de texto para poder modificarlo. 
        Para que &eacute;sta opci&oacute;n se active es necesario Guardar primero 
        los &uacute;ltimos cambios realizados en el frame. Una vez hechos los 
        cambios en el c&oacute;digo xml, guardar el fichero xml y al volver a 
        la ventana del Editor Malted se debe seleccionar el men&uacute;<font color="#CC0000"> 
        Edici&oacute;n &gt; Actualizar frame</font> para que se reflejen los cambios 
        en la ventana de edici&oacute;n del Frame.<br>
        <br>
        <strong>Actualizar Frame: </strong>Actualiza el frame cuando hemos realizado 
        cambios en el c&oacute;digo xml para que se reflejen los cambios en la 
        pantalla de edici&oacute;n.<br>
        <br>
        <strong>Preferencias:</strong> Abre la ventana &quot;Malted Opciones&quot; 
        que permite cambiar el idioma de la aplicaci&oacute;n, establecer si deseamos 
        que al iniciar el Editor Malted se abra en Modo Editor de Frames o de 
        Curso, a&ntilde;adir aplicaciones externas al men&uacute; de Herramientas, 
        y configurar el acceso a una Base de Datos.<br>
        <br>
        <img src="imagenes/pref_gener.gif" width="338" height="240"> <br>
        <br>
        </font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Frame&quot;<br>
        <br>
        </u> <font color="#000066">Las acciones de este men&uacute; est&aacute;n 
        disponibles s&oacute;lo en el caso de que haya alg&uacute;n frame activado.<br>
        <br>
        <strong>Propiedades:</strong></font></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"> 
        Abre la ventana de Propiedades del frame, donde se asignan la Interacci&oacute;n 
        y otras caracter&iacute;sticas generales del Frame.</font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><font color="#000066"> 
        Para m&aacute;s informaci&oacute;n <a href="frame_propiedades.htm">pulsar 
        aqu&iacute;.</a></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Descripci&oacute;n: 
        </strong>Abre el panel de propiedades de los frames en el que se encuentra 
        el Nombre del frame y una descripci&oacute;n del mismo que se puede modificar.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ejecutar 
        frame: </strong>Abre el Frame en modo de Previsualizaci&oacute;n con todas 
        las Acciones funcionales salvo aquellas que hagan referencia a otros frames 
        del Curso.<br>
        <br>
        </font><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Media&quot;<br><a name="importar"></a>
        <br>
        </u> <font color="#000066"><strong>Importar Media:</strong> </font></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">permite 
        localizar archivos Media que est&aacute;n fuera de nuestro Proyecto para 
        incorporarlos. Abre un cuadro de inserci&oacute;n desde el que se puede 
        seleccionar un fichero media del disco duro o cargar un fichero media 
        de una base de datos externa. <br>
        <br>
        <img src="imagenes/importar_media0.gif" width="438" height="249"><br>
        <br>
        Pulsamos en <strong>Buscar en discos locales</strong> y localizamos los 
        ficheros a importar.<br>
        <br>
        <img src="imagenes/importar_media1.gif" width="381" height="245"><br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        Al hacer doble click sobre un fichero se a&ntilde;ade a la lista de importaci&oacute;n 
        y tenemos la posibilidad de repetir el proceso con m&aacute;s ficheros. 
        <br>
        <br>
        <img src="imagenes/importar_media2.gif" width="438" height="249"><br>
        <br>
        Cuando hayamos terminado de agregar ficheros a la lista pulsamos <strong>Agergar 
        la lista al proyecto</strong>. Los archivos de la lista se copiaran en 
        las carpetas correspondientes (imagen, audio, etc) del proyecto.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Edici&oacute;n:</strong> 
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif">Inicia 
        un editor externo para editar el archivo media seleccionado. Se escoge 
        la aplicaci&oacute;n seg&uacute;n el tipo de formato que tenga el archivo 
        media, tal como est&aacute; definido en el apartado &quot;Opciones&quot;. 
        </font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Previsualizaci&oacute;n:</strong> 
        Proporciona una vista preliminar del archivo media seleccionado.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Renombrar:</strong> 
        Abre un cuadro de di&aacute;logo con un campo de texto lleno que corresponde 
        al nombre del archivo media actual. Se puede escribir un nombre nuevo 
        en el campo de texto y confirmar la acci&oacute;n haciendo clic sobre 
        la opci&oacute;n &quot;Aceptar&quot;.<font color="#CC0000"><u><br>
        <br>
        </u></font></font><font color="#CC0000"><u><font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Herramientas&quot;</u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        </font></u><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><br>
        Ofrece una lista de los editores disponibles (aplicaciones externas) que 
        han sido definidos previamente en el men&uacute; <font color="#CC0000">Edici&oacute;n 
        &gt; Preferencias</font>. Cada apartado de este men&uacute; abre la aplicaci&oacute;n 
        correspondiente. </font><font size="2" face="Arial, Helvetica, sans-serif"><u><br>
        <br>
        Men&uacute; &quot;Modo&quot;</u></font></font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Curso: 
        </strong>Activa el Modo Editor de Cursos.</font></p>
      <p><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Frame: 
        </strong>Activa el Modo Editor de Frames. <br>
        <br>
        En la segunda mitad del men&uacute; Modo aprece una lista con los Frames 
        abiertos. El frame activo aparece con un punto. Desde aqu&iacute; se puede 
        cambiar de frame activo para editar otro frame que est&eacute; abierto.<br>
        </font><br>
        <font color="#CC0000" size="2" face="Arial, Helvetica, sans-serif"><u>Men&uacute; 
        &quot;Ayuda&quot;<br>
        <br>
        </u></font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong>Ayuda 
        Malted: </strong>Abre una ventana con el tutorial del Editor Malted (DVE). 
        <br>
        <br>
        </font><font color="#000066" size="2" face="Arial, Helvetica, sans-serif"><strong> 
        Acerca de...: </strong>Abre una ventana con informaci&oacute;n sobre el 
        proyecto Malted.</font></p></td>
  </tr>
  <tr> 
    <td ><div align="right"><font size="2" face="Arial, Helvetica, sans-serif"><a href="Menu_Curso.htm"><br>
        &gt;&gt; Men&uacute; del Editor Malted (DVE) - Modo Editor de Cursos</a></font></div></td>
  </tr>
</table>
</body>
</html>
